[
    {
        "id":  195896,
        "version":  "3.1.760.0",
        "functionalNotes":  "Filter by All Periods on Credit Transfer screen",
        "developerNotes":  "No changes were made in this item.",
        "versionObject":  {
                              "minor":  1,
                              "build":  760,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Perfomance timeout on spf_TaxpayerAccountPeriod_selectForTaxpayer"
    },
    {
        "id":  213600,
        "version":  "3.1.777.0",
        "functionalNotes":  "Issue fixes to ensure 0% is showing when 0 is entered in the rate field",
        "developerNotes":  "Changed optional digit format character to zero pad format character.",
        "versionObject":  {
                              "minor":  1,
                              "build":  777,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Goods Tax Return - Zero Rated GT missing \u00270\u0027 %"
    },
    {
        "id":  218627,
        "version":  "3.1.768.0",
        "functionalNotes":  "Details of Browse - Accounts Summary tab matches the Previewed Report",
        "developerNotes":  "Added new column in report temp table to hold dates as dates for sorting while renaming the string column to be clear on data types when returning data.",
        "versionObject":  {
                              "minor":  1,
                              "build":  768,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Transaction Activity Statement - Sorting Order"
    },
    {
        "id":  218790,
        "version":  "3.1.777.0",
        "functionalNotes":  "The RMS database has CDC enabled, which involves the addition of a new schema (14, cdc), a new filegroup, and a new file.  Consequences of the enabling of CDC are that two new jobs are added to SQL Server Agent per RMS database with CDC enabled (capture and cleanup), and a new user (cdc) is added to the database.  These jobs and the new user should be left untouched.\n\nWhere management of databases does not use the master spts provided by DT, or they are not kept up to date, consideration should be given as to what changes are necessary for CDC integrity to be retained.",
        "developerNotes":  "Implementation of CDC\nWhat is it?\nAt this point it is the putting in place of the components needed to implement cdc tracking on tables.  It does not itself add cdc tracking.\nIt can be considered the equivalent of adding the BI database without adding BI processing.\nIt is invisible to the client, it does nothing.  Except where the client looks after the databases themselves.\n\nWhat does the update do?\nIt enables CDC on the RMS database, creates a new filegroup, creates a new file, adds the filegroup to the file.\nSQL Server does some changes to support this:\nIt adds a new schema, cdc (schema_id = 14).  (We must limit our queries of system tables to the dbo schema (schema_id = 1), we never bothered because we never had cause.  This update includes some amendments to that effect.)\nIt adds a new user, cdc.\nIt adds two new scheduled jobs, capture and cleanup, in the cdc schema.  These are executed by the cdc user.  Removing the cdc user causes the cleanup job to error.  Don\u0027t do that.\n\nIt adds new spt stored procedures:\nspt_EnableCDCForAnRMSDatabase - the procedure that enables cdc on the RMS database, creates a new filegroup, creates a new file, adds the filegroup to the file\nspt_SetCDCTrackingForATable - sets (or unsets) CDC tracking for a table, runs spt_CreateCDCTrigger and spt_EnableOrDisableRMSBITriggersForATable\nspt_SetCDCTrackingForAllTablesWithABITrigger - runs spt_SetCDCTrackingForATable for all tables with a BI trigger\nspt_CreateCDCTrigger - takes the BI trigger on the RMS table as a template, makes changes to make it suitable for the BI table, and applies it to the BI table\nspt_EnableOrDisableRMSBITriggersForATable - enables or disables the RMS BI trigger(s) on a table\n\nIt updates the RMS spt procedures that change the schema.\nspt_AddColumnToTable\nspt_AlterColumnOnTable\nspt_RemoveColumnFromTable\nspt_Rename_Column\nWhen called, these do additional things where the RMS table has cdc tracking enabled.  It disables then enables tracking.\n\nIt updates the RMS spt procedure that deletes and reseeds a table\nspt_DeleteAndReseed\nA table that has cdc tracking enabled cannot have TRUNCATE TABLE run against it.  This test is added to the existing test for a FK reference. \n\nIt updates all existing BI triggers to include new standard code that exits the trigger, doing nothing, if the table has cdc tracking enabled (except when integration tests are being run).  Note that the intent is that the RMS BI trigger would also be disabled when cdc tracking is enabled.\n\n**Any overrides of standard Iho triggers, and any new client-specific BI triggers should have that standard code added, as soon as possible.**",
        "versionObject":  {
                              "minor":  1,
                              "build":  777,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "CDC Trigger Implementation"
    },
    {
        "id":  220199,
        "version":  "3.1.739.0",
        "functionalNotes":  "There is no extra pop up when user has approved the case. User can progress through/ close the case without issue.",
        "developerNotes":  "Modified the CaseForm to override the PromptOnClose so does not display popup when saving an approved approval task.",
        "versionObject":  {
                              "minor":  1,
                              "build":  739,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "216137 APL case -Appeal Submission - An extra pop up shown when approve the case"
    },
    {
        "id":  223248,
        "version":  "3.1.759.0",
        "functionalNotes":  "Updated \u0027Amount\u0027 to \u0027Assessment Amount\u0027 for the name of the field in the Select Scope section of Objection Submission",
        "developerNotes":  "Modified the column to use the correct resouce",
        "versionObject":  {
                              "minor":  1,
                              "build":  759,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "OBJ - Spelling mistake in Objection Scope grid"
    },
    {
        "id":  228408,
        "version":  "3.1.743.0",
        "functionalNotes":  "User can do accounts adjustments - Witholding tax with no errors.",
        "developerNotes":  "Modified to check the tax type account when tax types have non-standard accounts",
        "versionObject":  {
                              "minor":  1,
                              "build":  743,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Account adjustment maintenance screen error"
    },
    {
        "id":  230094,
        "version":  "3.1.743.0",
        "functionalNotes":  "Issue fixes previously the remissions of refunds were not in the GeneralLedgerRevenueAccount table",
        "developerNotes":  "Updated the general ledger trigger to trigger of account adjustment types of code \u0027refrev\u0027 instead of account adjustment reasons of code \u0027refrev\u0027 Also updated the stored proc that processes the RevenueUpdateRequest  to do the same.",
        "versionObject":  {
                              "minor":  1,
                              "build":  743,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Refund Remission doesnt exist and when configured doesnt work with [RevenueUpdateRequest] and [GeneralLedgerRevenueAccount]"
    },
    {
        "id":  230271,
        "version":  "3.1.748.0",
        "functionalNotes":  "n/a",
        "developerNotes":  "n/a",
        "versionObject":  {
                              "minor":  1,
                              "build":  748,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Banking"
    },
    {
        "id":  230589,
        "version":  "3.1.758.0",
        "functionalNotes":  "When using the Save button at a negotiated instalment, and user goes Previous and Next the information is actually saved. Or when the user goes Save. Closes the tasks and re-opens the Case, the information has been saved.",
        "developerNotes":  "Add PreSerialise event to be run on case wizard Save button click. Update CaseTaskCreateArrangementsController to handle this event by correctly setting the DebtRecoveryArrangements",
        "versionObject":  {
                              "minor":  1,
                              "build":  758,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "DBT case - Data gets wiped away even though it is saved"
    },
    {
        "id":  237100,
        "version":  "3.1.736.0",
        "functionalNotes":  "Campaigns works without issue. Notifications and sent and received without error.",
        "developerNotes":  "Add new message type to handle bulk compliance updates triggered by campaigns\nAdd new bi update steps to update debt and return compliance data nightly\nFix issue with synonyms pointing to dropped table objects\nAdd bi health check tests to ensure population completes without errors\nAdd new step to regenerate bi views as part of the overnight process ( handles change tax return questions etc)\nAdd flag to generate synonym for those views automatically",
        "versionObject":  {
                              "minor":  1,
                              "build":  736,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Bulk Data Update Step - Compliance Data "
    },
    {
        "id":  237292,
        "version":  "3.1.768.0",
        "functionalNotes":  "Allows the Notice of Assessment to be readable. Was showing only the html rather than applying the CSS so as the notice can be read by the taxpayer online.",
        "developerNotes":  "Removed the duplicate selection from the stored procedure SQL",
        "versionObject":  {
                              "minor":  1,
                              "build":  768,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "[Return Assessment] ASC case - NOA - The Notice of Assessment rendering issue - the html and CSS displays and the Notification is not legible  "
    },
    {
        "id":  245658,
        "version":  "3.1.760.0",
        "functionalNotes":  "Issue fixes to set up the help url in the case",
        "developerNotes":  "Small fixes (mostly on the UI side) and adding a new sys const.",
        "versionObject":  {
                              "minor":  1,
                              "build":  760,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Task help file configuration"
    },
    {
        "id":  245918,
        "version":  "3.1.730.0",
        "functionalNotes":  "If the Next Task is Garnishee Management, no validation is expected and no record is expected. If the Next Task is Notice, the validation should be applied and the approval will be required.",
        "developerNotes":  "Modified the validation and added preprocessing to check the commit option to make sure the request is saved correctly",
        "versionObject":  {
                              "minor":  1,
                              "build":  730,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Garnishee request is saved when it shouldn\u0027t be"
    },
    {
        "id":  246028,
        "version":  "3.1.702.0",
        "functionalNotes":  "The notification task loads as normal, and the user can print the letter(s) and send email. This has been tested with induced error and fix in the local branch. Systest will be tested as normal CHG flow. CLients need to test the actual fix on their end.",
        "developerNotes":  "Fix null reference issues in notification processing",
        "versionObject":  {
                              "minor":  1,
                              "build":  702,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Notification task incorrectly assumes there is always an email configuration"
    },
    {
        "id":  246127,
        "version":  "3.1.713.0",
        "functionalNotes":  "spf_GetAssessmentsWithArrangements uses GETDATE instead of fGetCurrentDate which causes some integration tests that do timeshifting while creating Debt cases to not work. ran the SQL from dev and it does not return any issue.",
        "developerNotes":  "Replace GETDATE() with dbo.fGetCurrentDate() in spf_GetAssessmentsWithArrangements",
        "versionObject":  {
                              "minor":  1,
                              "build":  713,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Debt Case stored proc uses GETDATE instead of timeshift safe fGetCurrentDate"
    },
    {
        "id":  246825,
        "version":  "3.1.737.0",
        "functionalNotes":  "Issue 1 Resolved: When a period with a saved return draft online, but the return is filed in the BO, the draft line no longer appears on either the Returns List or the Drafts Returns page.\n\nIssue 2 Resolved: When looking at the Statement of the Tax Period (in Tax Accounts), the Options available says Correct (amend) this tax return and does not say Continue amending tax return until it becomes a draft amendment.",
        "developerNotes":  "Update spf_TaxReturnDraft_delete to support deleting drafts by TaxReturnHeaderID. Move this logic to TaxReturnRepository so that it is accessible by BO and called when TaxReturn.ReceivedDate is populated",
        "versionObject":  {
                              "minor":  1,
                              "build":  737,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Draft and completed return display online for the same period"
    },
    {
        "id":  249691,
        "version":  "3.1.728.0",
        "functionalNotes":  null,
        "developerNotes":  null,
        "versionObject":  {
                              "minor":  1,
                              "build":  728,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Tax Accounts drop down not sorted alphabetically"
    },
    {
        "id":  249983,
        "version":  "3.1.736.0",
        "functionalNotes":  "Client project will now be able to view report with data populating the report.",
        "developerNotes":  "Populated the report output with the values from the report table instead of populating zero.",
        "versionObject":  {
                              "minor":  1,
                              "build":  736,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Refund values are not populating in RET 002 Report"
    },
    {
        "id":  251635,
        "version":  "3.1.727.0",
        "functionalNotes":  "The Entered By: person on the Browse - Return page is now correctly been updated when it is submitted by a web user.",
        "developerNotes":  "Add SubmissionByUserID and SubmissionDate properties to be saved when the web returns are created.",
        "versionObject":  {
                              "minor":  1,
                              "build":  727,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Returns filed online show they were created by Administrator instead of the web user"
    },
    {
        "id":  251981,
        "version":  "3.1.738.0",
        "functionalNotes":  "No function changes, ensure In BI database, the records are populated in Debt Compliance and Return Compliance tables",
        "developerNotes":  "Small updates to some BI procs and a minor config change",
        "versionObject":  {
                              "minor":  1,
                              "build":  738,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "BI Processing - Return Compliance- Population by ID"
    },
    {
        "id":  252013,
        "version":  "3.1.747.0",
        "functionalNotes":  "New processing service added to run in the last day of each month, records that it\u0027s in UpcomingReturns table where Return Due Date  \u003c Today will be removed",
        "developerNotes":  "Added new processing service with existing monthly schedule to run stored proc that removes upcoming returns that are no longer upcoming.",
        "versionObject":  {
                              "minor":  1,
                              "build":  747,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "BI Processing - Upcoming Returns - Cleanup"
    },
    {
        "id":  253177,
        "version":  "3.1.749.0",
        "functionalNotes":  "For the returns in future, when a holidays is added if it\u0027s return due date, return due date will be updated to the next working day",
        "developerNotes":  "The dummy tax return creation process has been updated to check a feature flag RemoveTaxReturnsDueOnHolidays. If this feature is enabled, it will inactivate returns due on holidays before proceeding to create new ones.",
        "versionObject":  {
                              "minor":  1,
                              "build":  749,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Processing Service service that inactivates dummy returns due on holidays."
    },
    {
        "id":  253247,
        "version":  "3.1.757.0",
        "functionalNotes":  "OBJ case is not listed twice anymore",
        "developerNotes":  "Removed the duplicates in the stored procedure.",
        "versionObject":  {
                              "minor":  1,
                              "build":  757,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "APL - Same OBJ case listed twice in the Appeal Reference dropdown list"
    },
    {
        "id":  253590,
        "version":  "3.1.757.0",
        "functionalNotes":  "Tax type list in the Pay In Screen is now ascending in alphabetical order.",
        "developerNotes":  "Minor fix in spf_Taxpayer_selectSummaryInformation. No impact to client.",
        "versionObject":  {
                              "minor":  1,
                              "build":  757,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Tax types are not sorted in alphabetical order in Pay In Screen"
    },
    {
        "id":  254278,
        "version":  "3.1.726.0",
        "functionalNotes":  "Issue fixes that previously can\u0027t set the cheque amount = 0 where adjustment reason is Dishonoured Cheque",
        "developerNotes":  "Some changes around payment transaction/cheque/main validator, focusing on the logic - no zero amount is allowed when creating new payment AND no zero amount is allowed when making payment adjustment except when it\u0027s a dishonoured cheque.\nAdded new resource for error message - Validation_PaymentAdjustmentAmountCannotBeZero and Validation_TransactionAmountIsRequired, hence translation might be needed as required. \nMinor schema change in PaymentAdjustmentReason, rename column IsAllowedZeroAmountAdjustment with existing configuration value.",
        "versionObject":  {
                              "minor":  1,
                              "build":  726,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "[FTBackOfficeBankRecon] Can\u0027t do Dishonoured Cheque after Cashier Reconciliations "
    },
    {
        "id":  254354,
        "version":  "3.1.752.0",
        "functionalNotes":  "Topic is displayed in the message title when the feature is on, and it is not displayed when the feature is off",
        "developerNotes":  "Display topic in message title\n\nAdded a topic variable to conditionally display the correspondence topic in the page title.",
        "versionObject":  {
                              "minor":  1,
                              "build":  752,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Online conversation is missing the topic as part of the title."
    },
    {
        "id":  254676,
        "version":  "3.1.742.0",
        "functionalNotes":  "Issue fixes to ensure instalments can be auto/manual matched",
        "developerNotes":  "Changes made in product controlled proc spf_BRAutomaticMatchOnlineBankTransfer. No impact to client.",
        "versionObject":  {
                              "minor":  1,
                              "build":  742,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "BankRec Feature Review - Payment is not auto matched when making instalment payment online"
    },
    {
        "id":  255117,
        "version":  "3.1.709.0",
        "functionalNotes":  "It will now correctly add a default to the To date.",
        "developerNotes":  "No defaulting existed.  It has now been added.",
        "versionObject":  {
                              "minor":  1,
                              "build":  709,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "BankRec Feature Review - L - Find \u0026 Select - Date Filter UI"
    },
    {
        "id":  255144,
        "version":  "3.1.702.0",
        "functionalNotes":  "Issue fixes that clicking view icon went to Pay In screen rather than SUSR case",
        "developerNotes":  "Minor changes made around bank recon procs. No impact to clients.",
        "versionObject":  {
                              "minor":  1,
                              "build":  702,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "BankRec Feature Review - M- Match Transaction - Clicking View Icon should go to SUSR case rather than PayIn when adjustment made"
    },
    {
        "id":  255145,
        "version":  "3.1.702.0",
        "functionalNotes":  "Issue fixes that clicking view icon went to Pay In screen rather than SUSR case",
        "developerNotes":  "Minor changes made around bank recon procs. No impact to clients.",
        "versionObject":  {
                              "minor":  1,
                              "build":  702,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "BankRec Feature Review - M - Match Transaction - Clicking View Icon should go to SUSR case when payments is in SUSR"
    },
    {
        "id":  255177,
        "version":  "3.1.710.0",
        "functionalNotes":  "Update confirmation message to match FS",
        "developerNotes":  "Adding new resource key Label_DeleteBankStatementTransaction and minor fixes to all product-controlled procs spf_BSMatchTransactionLookupX , spf_GetBankReconciliationTransactions, spf_GetBankStatementMatchLinkByPayment. No impact to client project.",
        "versionObject":  {
                              "minor":  1,
                              "build":  710,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "BankRec Feature Review - H - Match Transaction - Deleting confirmation message missing words "
    },
    {
        "id":  255520,
        "version":  "3.1.700.0",
        "functionalNotes":  "Issue fixes that previously a pop up shows when clicking x without doing anything for withdrawal",
        "developerNotes":  null,
        "versionObject":  {
                              "minor":  1,
                              "build":  700,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "BankRec Feature Review - L - Match Transaction - Close pop-up behaviour when bank transaction is Withdrawal."
    },
    {
        "id":  255535,
        "version":  "3.1.713.0",
        "functionalNotes":  "Issue fixes to add the validation message when mandatory fields are required while adding an adjustment",
        "developerNotes":  "Added new resource key \u0027ValidatedProperty_BankStatementAdjustmentType\u0027. Translation might be needed, otherwise no impact to client.",
        "versionObject":  {
                              "minor":  1,
                              "build":  713,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "BankRec Feature Review - L - Adjustment Transaction - Close pop-up behaviour"
    },
    {
        "id":  255561,
        "version":  "3.1.730.0",
        "functionalNotes":  "Email fields is now longer, and TAX 003 report still works",
        "developerNotes":  "Extended the width of the report textbox control",
        "versionObject":  {
                              "minor":  1,
                              "build":  730,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "TAX 003 Email Address field is too narrow"
    },
    {
        "id":  255568,
        "version":  "3.1.734.0",
        "functionalNotes":  "UI fixes to make the date range consistent when changing the options from dropdown",
        "developerNotes":  "Extremely minor control fix in BankStatementImportController file. No impact to client.",
        "versionObject":  {
                              "minor":  1,
                              "build":  734,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "BankRec Feature Review - L - Bank Statement Imports  - Date Filter UI"
    },
    {
        "id":  255622,
        "version":  "3.1.756.0",
        "functionalNotes":  "N/A",
        "developerNotes":  "N/A",
        "versionObject":  {
                              "minor":  1,
                              "build":  756,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Credit transfer doesn\u0027t update proposed balance correctly, allows from period to be put into debit"
    },
    {
        "id":  255647,
        "version":  "3.1.709.0",
        "functionalNotes":  "It will now correctly show the eyeball icon, and allow viewing of the payment.",
        "developerNotes":  "No related UserInterface configuration had been set up for Outside Collection.  This was because, at the time of development (and even now, for that matter) the mechanism for recording a deposit by an outside agency, what payments that deposit covers, and how those payments end up in RMS has not been determined.  For now, the decision is that we just link to an Outside Collection payment, and assume that each collected payment is banked individually.",
        "versionObject":  {
                              "minor":  1,
                              "build":  709,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "BankRec Feature Review - L - Find \u0026 Select - User is not able to preview Outside Collection payment"
    },
    {
        "id":  255742,
        "version":  "3.1.713.0",
        "functionalNotes":  "New TPRP Test for Browse Snapshot, and related functions. Adding helper functions for TPRP Browse Snaphot and update on Grid Method.",
        "developerNotes":  "New TPRP Test for Browse Snapshot, and related functions. Adding helper functions for TPRP Browse Snaphot and update on Grid Method.",
        "versionObject":  {
                              "minor":  1,
                              "build":  713,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "TestComplete - TPRP Browse Snapshot"
    },
    {
        "id":  255743,
        "version":  "3.1.724.0",
        "functionalNotes":  "n/a",
        "developerNotes":  "n/a",
        "versionObject":  {
                              "minor":  1,
                              "build":  724,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "TestComplete - TPRP Department and Industry"
    },
    {
        "id":  255745,
        "version":  "3.1.730.0",
        "functionalNotes":  "This is about Test Complete Test on TPRP Payments - test passed in pipeline",
        "developerNotes":  "This is about Test Complete Test on TPRP Payments - test passed in pipeline",
        "versionObject":  {
                              "minor":  1,
                              "build":  730,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "TestComplete - TPRP Payments"
    },
    {
        "id":  255765,
        "version":  "3.1.697.0",
        "functionalNotes":  "There are no functional behaviour changes in RMS email sending through this change. It exists to be compatible with some client infrastructure requirements of using SSL for sending email.",
        "developerNotes":  "A new system constant has been added \"SMTPEnableSSL\". This boolean system constant defaults to false, which is the behavior of Iho previously. \nFor any client implementations that need to send email via SMTP with SSL, setting this system constant to true will allow emails to be sent without receiving an error. An example would be when emails are being sent using Exchange Online\u0027s High Volume Email, which requires SSL.",
        "versionObject":  {
                              "minor":  1,
                              "build":  697,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "smtp.EnableSsl = systemConstantRepository.GetBoolean(\"SMTPEnableSSL\", false);"
    },
    {
        "id":  255854,
        "version":  "3.1.724.0",
        "functionalNotes":  "Issue fixes to ensure when the deposit (cash or cheque) matched, the bank deposit won\u0027t be able to be deleted",
        "developerNotes":  "Minor fix in BankDepositListController and Model file and added new calculator method into new calculator file BankDepositCalculator. No impact to client that has BankRecon feature disabled.",
        "versionObject":  {
                              "minor":  1,
                              "build":  724,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "BankRec Feature Review - M - Bank Deposit - Bank Deposit can be deleted when the cashier or the cheque is matched"
    },
    {
        "id":  255857,
        "version":  "3.1.738.0",
        "functionalNotes":  "Issue fixes to ensure the payments can\u0027t be deleted after cashier recon has completed",
        "developerNotes":  "Minor ui fix in CashierReconciliationListController. No changes required from client.",
        "versionObject":  {
                              "minor":  1,
                              "build":  738,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "BankRec Feature Review - M - Cash Reconciliation - Once the cashier reconciliation is banked, the user should not be able to delete it"
    },
    {
        "id":  255859,
        "version":  "3.1.709.0",
        "functionalNotes":  "It will now correctly not display the pop-up if the payment screen is opened in view-only mode.",
        "developerNotes":  "No testing for the screen mode existed.  It has now been added.",
        "versionObject":  {
                              "minor":  1,
                              "build":  709,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "BankRec Feature Review - L - Match Transtion / Find \u0026 Selection - Preview payments from a blocklisted taxpayer"
    },
    {
        "id":  255882,
        "version":  "3.1.704.0",
        "functionalNotes":  "Now it will correctly match one side of the transfer with the other.",
        "developerNotes":  "Small bug in the matching candidates query.",
        "versionObject":  {
                              "minor":  1,
                              "build":  704,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "BankRec Feature Review - L - Find \u0026 Select - Bank Transfer filter is not applied as expected"
    },
    {
        "id":  255913,
        "version":  "3.1.727.0",
        "functionalNotes":  "Ensure payments created via bank recon, AccountID won\u0027t be changed when allocating \nEnsure payments made via PayIn, AccountID will be changed when changing tax type from the ones in main to the ones in secondary i.e. from VAT to PAYE",
        "developerNotes":  "Major change around spf_PostPaymentProcess_Client but that\u0027s completely Iho custom work - so no impact to client. \nMinor change in spf_CheckPaymentRelatedCashierReconcile - this is a standard product behaviour that applies to all client.",
        "versionObject":  {
                              "minor":  1,
                              "build":  727,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "BankRec Feature Review - M - Post Payment Processing for SUSR Allocation"
    },
    {
        "id":  256230,
        "version":  "3.1.698.0",
        "functionalNotes":  "Corrected functionality",
        "developerNotes":  "It:\nApplied the reversal and did penalty processing.\nUpdated the payment GL record with the ReverseID.\n\nI changed it to:\nApply the reversal.\nUpdated the payment GL record with the ReverseID and do the penalty processing.",
        "versionObject":  {
                              "minor":  1,
                              "build":  698,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "LPP and LPI should apply/adjusted when a payment is deleted"
    },
    {
        "id":  256271,
        "version":  "3.1.706.0",
        "functionalNotes":  "Set Y axis with a proper value to ensure Y axis value is not doubled if it\u0027s a small number",
        "developerNotes":  "Fixed the Y Axis and set to minimum of 5 when the totals are small",
        "versionObject":  {
                              "minor":  1,
                              "build":  706,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Management Dashboard - Y axis number will be double up when it\u0027s small "
    },
    {
        "id":  256303,
        "version":  "3.1.760.0",
        "functionalNotes":  "There is no error when navigating to back to steps below. and user can close case",
        "developerNotes":  "Prevent time spent validation on save of active task within case when the active task is not the current task",
        "versionObject":  {
                              "minor":  1,
                              "build":  760,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Historic Task \u0027Save and Continue\u0027 Error - Scenario requires a combination of Case Tasks that have CommitsBusinessObject, TaskTimeSpentRequired, IsSavedWhenClean, Historic Task."
    },
    {
        "id":  256308,
        "version":  "3.1.709.0",
        "functionalNotes":  null,
        "developerNotes":  null,
        "versionObject":  {
                              "minor":  1,
                              "build":  709,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Deadlocks in the LogError table"
    },
    {
        "id":  256525,
        "version":  "3.1.713.0",
        "functionalNotes":  "Issue fixes that previously when clicking Close button or x icon, mandatory check was skipped when clicking Yes button on prompting window",
        "developerNotes":  "Added new calculator method IsMatchTransactionsAllowSave and new resource key Message_MatchTransactionsZeroDifferenceError. Translation might be needed, otherwise no impact to client.",
        "versionObject":  {
                              "minor":  1,
                              "build":  713,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "BankRec Feature Review - M - Match Transaction - Close pop-up behaviour leads to partial match"
    },
    {
        "id":  256527,
        "version":  "3.1.715.0",
        "functionalNotes":  "Fix status display as per logic",
        "developerNotes":  "Minor fix in product controlled procs spf_BRMatchedDetailsPayment and spf_GetBankStatementMatchedDetailsList. No impact to client.",
        "versionObject":  {
                              "minor":  1,
                              "build":  715,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "BankRec Feature Review - L - Match Transaction - Close pop-up behaviour - Match transactions disappear after the 2nd unmatch"
    },
    {
        "id":  257164,
        "version":  "3.1.712.0",
        "functionalNotes":  "When a suspense payment is made against the suspense account (i.e. 999999998 instead of a Taxpayer), when the auto-created SUSR case is progressed to the notification task it should default to the taxpayers preference of notification (email/letter). Prior to this change there is no default and the screen is blank until you select email/letter",
        "developerNotes":  "Added checks to the CaseTaskTaxpayerMultipleNotificationController so that IsCommunicationPreference checks if is a suspense case and if the taxpayer is the suspense taxpayer and then sets the preferred communication type to be the taxpayer that has been selected to receive the payment",
        "versionObject":  {
                              "minor":  1,
                              "build":  712,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "SUSR created by Case Selection doesn\u0027t have a notification type ticked by default"
    },
    {
        "id":  257289,
        "version":  "3.1.709.0",
        "functionalNotes":  "Issue fixes that previously the suspense payments reversed twice when allocating to periods where more than one periods to allocate",
        "developerNotes":  "Changed the reversal of payment to select only unique payment transaction id\u0027s to reverse so when multiple new payment transactions were created they did not cause double reversals.",
        "versionObject":  {
                              "minor":  1,
                              "build":  709,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Suspense Case has reversed a payment more than once resulting in an incorrect debt against taxpayer"
    },
    {
        "id":  257537,
        "version":  "3.1.709.0",
        "functionalNotes":  "It will now correctly exclude cheques that were not dishonoured.",
        "developerNotes":  "The filtering on the cheque records in the current version was incorrect.",
        "versionObject":  {
                              "minor":  1,
                              "build":  709,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "BankRec Feature Review - H - Find \u0026 Select - Only dishonoured cheque should be listed when Transaction Type is dishonoured cheque"
    },
    {
        "id":  257637,
        "version":  "3.1.704.0",
        "functionalNotes":  "Change to spf_CalculatePenaltyOpeningAmounts to correctly identify a refund.",
        "developerNotes":  "Incorrectly processed refund GL records (identifiable by the incorrect RelatedTransactionTypeID, it should be 5, it is 2 where this problem has occurred) are recorded in a table called TFS257637Output.  These records are updated with the correct values in RelatedTransactionTypeID and RelatedTransactionID.\nThe retention of TFS257637Output allows further investigation of potentially incorrect GeneralLedgerRevenueAccount records, which is outside the scope of this bugfix.\n\nNote that one consequence of this fix and data correction is that an over-refund now results in penalties.  This would be a situation where a credit return is refunded, then assessed to a smaller credit, leaving a debit balance.",
        "versionObject":  {
                              "minor":  1,
                              "build":  704,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "spf_ProcessPenalty inserting into PaymentTransactionBreakdown"
    },
    {
        "id":  257645,
        "version":  "3.1.698.0",
        "functionalNotes":  "Primary Email field is now showing in yellow as per normal mandatory field in Registration Details.",
        "developerNotes":  "Fixed the background color for mandatory email address textbox",
        "versionObject":  {
                              "minor":  1,
                              "build":  698,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "REG: Email not showing as mandatory"
    },
    {
        "id":  257647,
        "version":  "3.1.701.0",
        "functionalNotes":  "Clicking the Save and Continue message is not displayed in the return overview step.",
        "developerNotes":  "Use correct saveAmpContinueMessageText resource text on return overview page",
        "versionObject":  {
                              "minor":  1,
                              "build":  701,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Tax return Online Overview page is not displaying Clicking and Save and Continue message."
    },
    {
        "id":  257681,
        "version":  "3.1.699.0",
        "functionalNotes":  "Objection is mapped as entered in the RMS online.",
        "developerNotes":  "Support line returns for explanation textboxes in BO objection case UI",
        "versionObject":  {
                              "minor":  1,
                              "build":  699,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Online OBJ to back office OBJ case mapping - Objection details multiline textbox mapping"
    },
    {
        "id":  257701,
        "version":  "3.1.724.0",
        "functionalNotes":  "Ad hoc taxes are no longer displaying the Return Period on the Return Details page.",
        "developerNotes":  "Hide period when it is adhoc or adhoc multiple\n\nKey changes include:\n\nAdded IsAdhoc to taxReturnSummaryDetail in TaxReturnViewRepository.cs.\nUpdated ITaxReturnSummaryInformation.cs and TaxReturnSummaryInformation.cs to include the new property.\nModified ReturnSummary.vue to conditionally display return period information based on the adhoc status.\nEnhanced computed properties in ReturnSummary.vue to manage visibility based on the new IsAdhoc property.\nUpdated mapDataToSummary in store.ts to reflect the adhoc status in the summary object.\nRevised IReturnSummary.ts to include the isAdhoc property for better representation of tax return summaries.",
        "versionObject":  {
                              "minor":  1,
                              "build":  724,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Return period row should be hidden where the return frequency is adhoc or adhoc multiple"
    },
    {
        "id":  257831,
        "version":  "3.1.729.0",
        "functionalNotes":  "Both configurations of Multiple Ad hoc tax types using the return submission date (AMRRT) and the other using a return period defined by a return period (AMPART) are working as expected. The return period is filed and creates a new sequential period for the same return period. E.g. Period 9 July (#1) 2025 is filed and then 9 July (#2) is created when a new return is filed for the same period (day).",
        "developerNotes":  "Add support for multi ad hoc returns and specifying a period via return question\n\nAdd the ability to set tax return period for AdHoc (NoPeriodSelection) tax type returns via a question in the return.\nAmending the return doesn\u0027t change the period.\nUpdated TaxReturnMapper to include IsMultiAdHoc property.\nIntroduced taxPeriodRepository in TaxReturnWizardRepository for managing tax periods.\nModified methods in TaxReturnWizardRepository to handle ad hoc return logic.\nEnhanced ApiRegistrationRepository to manage tax type registrations and handle cases with no registration.\nUpdated ITaxReturnDraft interface and its implementation to reflect new properties.\nAdded AdHocReturnsPeriodQuestions in SystemConfiguration for storing related questions.\nUpdated SQL scripts to support new ad hoc return logic.\nCreated ITaxTypePeriodQuestion and TaxTypePeriodQuestion classes for better structure.\nAdded tests in ApiRegistrationRepositoryTest to validate new functionality.",
        "versionObject":  {
                              "minor":  1,
                              "build":  729,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "The return period is determined by either a configured question in the return design or the return submission date"
    },
    {
        "id":  257832,
        "version":  "3.1.712.0",
        "functionalNotes":  "A disclaimer pops up when it has been configured by the client re Tax Types. The modifiers are working as per the AC for FP23.",
        "developerNotes":  "Added functionality to configure a single disclaimer per tax type, and have it display when custom date calculation (\u0027o\u0027) applies.\nFor a disclaimer to appear:\n1. The tax type must be either \u0027adhoc\u0027 or \u0027adhoc-multiple\u0027\n2. The DisclaimerText column on the TaxType table must contain a value\n3. The tax type must be associated with at least one active TaxTypeDays table entry with \u0027o\u0027 as the modifier. This can be any/all of ReturnDueModifier, PaymentModifier, and GraceModifier",
        "versionObject":  {
                              "minor":  1,
                              "build":  712,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Display disclaimer text based on tax type configuration"
    },
    {
        "id":  257835,
        "version":  "3.1.742.0",
        "functionalNotes":  "UI changes to Ad hoc returns. \nPoints updated to mention which functionality implements the expected FP result.\nMOC =\u003e Multi Adhoc\nNPS =\u003e No-Period Selection before starting to file the return.\n\u0027o\u0027 =\u003e Return/Payment DueDate modifiers are set to \u0027o\u0027 or \u0027r\u0027\n\nFP24 - File a return / with existing draft:\nThe user can only have one draft in progress: add \u0027draft return in progress\u0027 message + continue draft and delete draft buttons NPS \nNew modal to display on deletion, showing information in the modal about when the return was last updated NPS \nFP25 - File a return:\nRemove / hide:\n\u0027For the period: x\u0027 NPS, \u0027o\u0027\nPayment due date \u0027o\u0027 \nReturn due date \u0027o\u0027 \nPeriod NPS, \u0027o\u0027\nFP26 - Amendment:\nAdd tooltips for return due date / payment due date - \"Values you enter in the return may change the final due date\" \u0027o\u0027 \nFP27 - Submit a return:\nThank you for completing your ... return for ... - to include a return number along with the date - #1/#2/#3 MOC \nFP28 - Amendment - Submit a return:\nAs above, only the return number should not change upon submission MOC \nFP29 - Draft Return:\nDraft adhoc returns to display \u0027-\u0027 for year/period/due date and only show when the current year is selected NPS (hides Period), \u0027o\u0027\nFP30 - Return List - Sorting:\nReturn list to be sorted by standard period sort order, return number MOC .. requirements have been changed by Task 257842\nFP31 - Draft Amendments\nTo display in draft returns list with the original period/return number/etc MOC \nFP32 - Tax Accounts / Returns List\nPeriod and due date should display here upon submission NPS, \u0027o\u0027\nFP33 - View Return - Details\nReturn period row to be hidden for adhoc/adhoc multiple tax types MOC (and original adhoc)\nApplies to both adhoc and adhoc-multiple MOC (and original adhoc)",
        "developerNotes":  "Added draft return in progress UI for No Period Selection Require tax types\nAdded localized string DraftReturnInProgressText in ResourceHelper.cs, ResourceKeys_Cshtml.cs, and resource files.\nModified ReturnAddController.cs to filter out amendment drafts when no period selection is required and we are trying to return existing filing return drafts(not amendment).\nUpdated ReturnAdd.cshtml to display the draft return in progress message.\nEnhanced JavaScript in ReturnAdd.js to manage visibility of draft return messages and buttons for no period selection option.\nFixed trying to continue a new return draft when an amendment draft exists for the same tax type (No-Period Selection Required)",
        "versionObject":  {
                              "minor":  1,
                              "build":  742,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "File a Return Ad-hoc UI changes"
    },
    {
        "id":  257836,
        "version":  "3.1.719.0",
        "functionalNotes":  "New UI around deleting a Draft Adhoc tax type return. The modal displays and confirms whether you want to delete the draft or not. Only one draft at a time\nAlso need the ReturnDueDate Modifier and PaymentDue Modifier to be set to lower case o\u0027s",
        "developerNotes":  "Manage Confirmation modal when deleting adhoc draft that doesn\u0027t require a period selection\n\nIntroduced LastUpdateDateDisplay in SQL query and ITaxReturnNonFiledResult interface.\nAdded localization for delete confirmation message in ResourceHelper.cs and resource files.\nUpdated ReturnAdd.cshtml and JavaScript to support new last updated date functionality.",
        "versionObject":  {
                              "minor":  1,
                              "build":  719,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "New Delete Draft return confirmation"
    },
    {
        "id":  257839,
        "version":  "3.1.728.0",
        "functionalNotes":  "Able to file sequential returns for multiple ad hoc tax types on the same day.",
        "developerNotes":  "Fixed online caching to allow filing multiple adhoc returns\n\nTechnical details:\nImplemented key tracking for InMemoryCache\n\nIntroduced a ConcurrentDictionary to manage cache keys in the InMemoryCache class, addressing the lack of key retrieval in .NET 6.0.\nUpdated the Add and Remove methods to maintain this dictionary, ensuring thread-safe key management.\nRefactored RemoveAll method to facilitate bulk removal of cache entries based on a filter using LINQ.",
        "versionObject":  {
                              "minor":  1,
                              "build":  728,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "When the return is submitted, it will be marked with an appropriate sequence"
    },
    {
        "id":  257840,
        "version":  "3.1.729.0",
        "functionalNotes":  "Amendments to the return question will not change the already determined return period. The Return Number will remain displayed in the Period Description. The Amended Due Date and Payment Due Date will be updated based on the configured logic for the return.",
        "developerNotes":  "Add support for multi ad hoc returns and specifying a period via return question\n\nAdd the ability to set tax return period for AdHoc (NoPeriodSelection) tax type returns via a question in the return.\nAmending the return doesn\u0027t change the period.\nUpdated TaxReturnMapper to include IsMultiAdHoc property.\nIntroduced taxPeriodRepository in TaxReturnWizardRepository for managing tax periods.\nModified methods in TaxReturnWizardRepository to handle ad hoc return logic.\nEnhanced ApiRegistrationRepository to manage tax type registrations and handle cases with no registration.\nUpdated ITaxReturnDraft interface and its implementation to reflect new properties.\nAdded AdHocReturnsPeriodQuestions in SystemConfiguration for storing related questions.\nUpdated SQL scripts to support new ad hoc return logic.\nCreated ITaxTypePeriodQuestion and TaxTypePeriodQuestion classes for better structure.\nAdded tests in ApiRegistrationRepositoryTest to validate new functionality.",
        "versionObject":  {
                              "minor":  1,
                              "build":  729,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "The Return Number will remain displayed in the Period Description of Return Amendment"
    },
    {
        "id":  257842,
        "version":  "3.1.738.0",
        "functionalNotes":  "Adhoc Multiple Parent Auto Registered Tax:\nAlready existing tax type\nAllows multiple returns to be filed per day for the taxpayer (only one draft at a time)\nDoes not have due date modifier \u0027o\u0027 for Payment or Return\n\nIf a due date modifier \u0027o\u0027 is used for Payment or Return, then there is not Due Date displayed in Draft Progress or Return List until the return has been submitted.\nWhen there is a Return Draft in progress for AMPART (NoPeriodSelectionUI), there is no Year or period displayed on the Return List page and No Period displayed on the Draft Returns page. Hereinafter, once the date has been set from submitting the return, as the Period has been established and won\u0027t change including when amending a return and will appear as such in Return List (Complete Return and Amending Return, Draft Returns (Amending Return) and Tax Accounts (Completed return and Amendment).",
        "developerNotes":  "VERY IMPORTANT:\nTo be able to view the Multiple Ad hoc return number in the period (i.e show 15 July (#1)) in Tax Accounts and Returns list page, project will need to empty OnlineReturn_AdhocPeriodDateFormat system constant value\ni.e.\nEXEC spf_SystemConstant_set\n    @Name          = \u0027OnlineReturn_AdhocPeriodDateFormat\u0027,\n    @ConstantValue = \u0027\u0027;\nReason is the current behaviour is to show the Ad hoc Period in the format of OnlineReturn_AdhocPeriodDateFormat which is set to dd MMM.\n\nOther changes:\nHandle displaying period, year and due dates based on config of tax type and due modifiers\n\nFixes navigating to amendment draft from tax accounts drafts page.\nIntroduces IsAmendment property in TaxReturnMapper.cs to manage amendment logic for PeriodName, YearName, and ReturnDueDateDisplay.\nUpdates OnlineReturn_AdhocPeriodDateFormat in Iho-Only.sql and SystemConstants.xml to an empty string.\nModifies AccountController.cs to check for IsAmendment when setting PeriodName.\nAdjusts rendering logic in DraftReturn.js to account for isAmendment in period display and URL path for actions.\nAdded a new hidden column for periodName, rendered using the onRenderPeriod function.\nUpdated the tax accounts DataTable to include additional sorting criteria, now also ordering by the Period date, and the period name columns in descending order. Beside the original due date in desc.",
        "versionObject":  {
                              "minor":  1,
                              "build":  738,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "By default, the Return List should be sorted by the standard period sort order, return number"
    },
    {
        "id":  257844,
        "version":  "3.1.699.0",
        "functionalNotes":  "When a required document in Online Objection case is uploaded and moved through to the Review and Submit page and then gone backwards to remove the document and then uploaded another document, it successfully moves through to the Review and Submit page.",
        "developerNotes":  "Move popStateDetected fix that stops navigation being aborted due to navigation guard to common filebatchuploadsuccess event raised area so that all areas using filebatchuploadsuccess events will have this fix applied",
        "versionObject":  {
                              "minor":  1,
                              "build":  699,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Required Documents vs Online Request submit page"
    },
    {
        "id":  258057,
        "version":  "3.1.730.0",
        "functionalNotes":  "Issue fixes that previously Online bank transfer was not auto matched the electronic payment in RMS",
        "developerNotes":  "Iho-Only data script to fix iho configuration in BankStatementProcessTypePaymentNonCashType. No impact to client. \nProc fix in spf_BRAutomaticMatchOnlineBankTransfer to allow matching using payment reference code if any. It\u0027s a product controlled proc, hence no impact to client.",
        "versionObject":  {
                              "minor":  1,
                              "build":  730,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "BankRec Feature Review - M - Find \u0026 Select - Online Bank Transfer payment is not created unless it\u0027s auto matched"
    },
    {
        "id":  258197,
        "version":  "3.1.743.0",
        "functionalNotes":  "N/A. This unit test ticket has had no effect on the system and so no need to test this ticket.",
        "developerNotes":  "Update TaxpayerPopulator in IhoUnitTestFramework to support related contact relationship answers and make the class easier to extend in client layers by making methods virtual\n\nGuyana team - Please note that the logic in GuyanaTaxpayerPopulator.cs (from the version of it linked in this description) now exists in Iho and this should be removed from Guyana layer so that it isn\u0027t duplicated",
        "versionObject":  {
                              "minor":  1,
                              "build":  743,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Unit test framework - Related Contacts additional questions"
    },
    {
        "id":  258350,
        "version":  "3.1.708.0",
        "functionalNotes":  "The Risk Status history widget can now display 10 entries without needing to scroll (at most it can show 10, there may be a scroll depending on screen resolution, but it will no longer always show 3 with a scroll required)",
        "developerNotes":  "The grid containing the history items has been changed to fill the container, instead of docking to the top.",
        "versionObject":  {
                              "minor":  1,
                              "build":  708,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "TPRP - Risk Status History minor UI issue - Scrollbar unnecessary"
    },
    {
        "id":  258351,
        "version":  "3.1.704.0",
        "functionalNotes":  "No change necessary, 255882 fixed it.",
        "developerNotes":  "No change necessary, 255882 fixed it.",
        "versionObject":  {
                              "minor":  1,
                              "build":  704,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "BankRec Feature Review - H - Find \u0026 Select  - Transfer transaction is not listed"
    },
    {
        "id":  258420,
        "version":  "3.1.734.0",
        "functionalNotes":  "Permission fixes to match FS",
        "developerNotes":  "1. No impact to client: Create new user interface - secAddBankRecPaymentAdjustment, secAddBankRecAdjustment\n2. Client team to check Admin/SA configuration: Configure role permission for this new user interface - Admin/SA/BRO/BRS in Data script as part of feature work\n3. No impact to client: Minor proc fix to ensure IsCreatePayment is returned from BankStatementAdjustmentType table\n4. No impact to client: Use this flag to determine what to filter in AdjustmentReasonList - logic handling in model and controller files",
        "versionObject":  {
                              "minor":  1,
                              "build":  734,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Bank Recon - Permissions - Payment Officer and Payment Supervisor have the permissions to add Payment of Adjustment"
    },
    {
        "id":  258634,
        "version":  "3.1.727.0",
        "functionalNotes":  "Permission issues fix to make it consistent without showing Delete button when users don\u0027t have delete permission",
        "developerNotes":  "Minor fix in MatchTransactionsController file to configure DeleteBankTransactionButton.Visible for users with permission only. No impact to client.",
        "versionObject":  {
                              "minor":  1,
                              "build":  727,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Bank Recon - Permissions - Delete Bank Transaction permission behaviour inconsistent between matched and non matched transactions"
    },
    {
        "id":  258703,
        "version":  "3.1.729.0",
        "functionalNotes":  "Issue fixes that previously user had the Allow Undoing Reconciliation period permission while the permission is not given",
        "developerNotes":  "Minor logic handling fix in BankReconciliationHistoryController and ReconcileBankAccountController file to show/hide Undo button. No impact to client.",
        "versionObject":  {
                              "minor":  1,
                              "build":  729,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Bank Recon - Permissions - When \u0027Allow Undoing Reconciliation period\u0027 is disabled, the user can still Undo reconciliation from Bank Reconciliation History "
    },
    {
        "id":  258857,
        "version":  "3.1.738.0",
        "functionalNotes":  "When an amended return is in draft, the Continue Draft button in the Draft returns tab correctly takes you through to the draft was previously left.",
        "developerNotes":  "Fixes navigating to amendment draft from tax accounts drafts page.",
        "versionObject":  {
                              "minor":  1,
                              "build":  738,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Online Return Filing - Amended return in draft - From Draft returns tab, user incorrectly taken to the Returns List"
    },
    {
        "id":  258975,
        "version":  "3.1.695.0",
        "functionalNotes":  "To configure the auto credit transfer behaviours based on return frequencies for the same tax type for both of push and pull.",
        "developerNotes":  "New column (ReturnFrequencyID) added to TaxTypeAutoCreditTransferConfiguration, and made part of the primary key (was TaxTypeID, now TaxTypeID / ReturnFrequencyID).\n(This field is NOT nullable, there is no NULL value that could cover all return frequencies without a specific record, a catchall, as this would remove the ability to not have ACT for a return frequency.  If a return frequency does not support ACT, this is indicated by no active record on TaxTypeAutoCreditTransferConfiguration.)\nAs part of the upgrade all existing configuration for a tax type has been applied to all return frequencies valid for that tax type.\nThe TaxType worksheet and json files have had the ACT configuration removed.  TaxTypeAutoCreditTransferConfiguration has its own json file, and its own worksheet in the TaxType spreadsheet, thus enabling multiple sets of data per tax type.\nThe derivation of the appropriate ACT configuration depends on the return frequency of the period being processed.  It is not expected that taxpayers will be changing return frequencies for a registration.\nOnce the configuration has been found, the subsequent functionality is unchanged.\n\nNote that these changes will require changes to the clients\u0027 spreadsheets and / or json (depending on what\u0027s being used) to match the new templates.",
        "versionObject":  {
                              "minor":  1,
                              "build":  695,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "See User Story - Configure max transfer period per tax type return frequency"
    },
    {
        "id":  259406,
        "version":  "3.1.722.0",
        "functionalNotes":  "Issue fixes to ensure the Due Dates are showing for the draft of amendment of filed return",
        "developerNotes":  "Add IsAmendment property to tax account handling\n\nUpdated SQL, model, and controller to include IsAmendment.\nModified logic for DueDate and rendering in DraftReturn.js\nto account for amendment status. Enhanced JSON response\nto include IsAmendment for tax accounts.",
        "versionObject":  {
                              "minor":  1,
                              "build":  722,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Status and Due Date should be showing on Drafts Return tab for the return which is the draft of amendment "
    },
    {
        "id":  259467,
        "version":  "3.1.727.0",
        "functionalNotes":  "Submission type is now correctly displayed in RMS web and checked as well in the back office, and it is also displayed.",
        "developerNotes":  "Added translations if they are not present for \u0027en\u0027, and pseudo translations for Iho-Only\nDev Notes:\nTranslations missing.\nThey were created in http://tfsserver:8080/tfs/Iho/Iho/_versionControl/changeset/48943?path=%24%2FIho%2Fv3%2FSrc-Dev-OnlineTPReg%2FIhoDatabase%2FChange%20Scripts%2FVersion%203.0.93.174%2FData.sql\nbut lately deleted in http://tfsserver:8080/tfs/Iho/Iho/_versionControl?path=%24%2FIho%2Fv3%2FSrc%2FIhoDatabase%2FChange%20Scripts%2FVersion%203.0.190.0%2FIho-Only.sql",
        "versionObject":  {
                              "minor":  1,
                              "build":  727,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Online - Returns submitted Online are not having their Submission Method displayed when viewed"
    },
    {
        "id":  259570,
        "version":  "3.1.701.0",
        "functionalNotes":  "PersonalNameValidationType works with the below settings\n1 = First and last name required\n2 = Only first name required\n3 = Only last name required\n4 = Required to provide either the first or last name",
        "developerNotes":  "Support validation for all PersonalNameValidationType enum values from \u0027PersonalNameValidationType\u0027 system constant. TaxpayerAccessRequestNameRequired attribute has been created to achieve this. \n\nThis can be tested by updating the \u0027PersonalNameValidationType\u0027 system constant. These are the possible values for this system constant:\n1 = First and last name required\n2 = Only first name required\n3 = Only last name required\n4 = Required to provide either the first or last name",
        "versionObject":  {
                              "minor":  1,
                              "build":  701,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Development - Request Access TIN - Apply PersonalNameValidationType to your name"
    },
    {
        "id":  259594,
        "version":  "3.1.721.0",
        "functionalNotes":  "Validation is working correctly online for Profile, Alternative name for an INDIVIDUAL taxpayer when the settings are:\n\n  --FirstAndLastName = 1 (Standard Config)\n  --FirstNameOnly = 2 (Added for Bhutan)\n  --LastNameOnly = 3\n  --EitherFirstOrLast = 4",
        "developerNotes":  "The TPREG does not use the systemConstant PersonalNameValidationType so Mandatory for the FirstName, LastName etc. is controlled by the Ismanadtory field of the OnlineRequestQuestion table.\nThe Online Profile is now controlled by the systemConstant PersonalNameValidationType so the fields are made mandatory according to this setting.",
        "versionObject":  {
                              "minor":  1,
                              "build":  721,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Bhutan - Online - Profile - Alternative Name - when adding or editing Profile for Alternative name a validation message displays saying Surname is required"
    },
    {
        "id":  259685,
        "version":  "3.1.701.0",
        "functionalNotes":  "Part 1 of this ticket is in 3.1.699.0 Pull request 3362\nhttp://tfsserver:8080/tfs/Iho/Iho/_git/iho-v3/pullrequest/3362?_a=overview\n\nPart 2 of this ticket is in (3.1.700.0 or higher) Pull Request 3552 \nhttp://tfsserver:8080/tfs/Iho/Iho/_git/iho-v3/pullrequest/3552?_a=overview\n\nPart 3 of this ticket is internal - where the tester is testing that RMSSandbox_SysTest is configured to that of the Functional Specs and to Ihov3_SysTest.\n\nOpen case Historically old debt case - DBT99 in local branch and Back Office crashes - this to be resolved in another ticket as it\u0027s to do with config of local branches.\nPayment frequencies Weekly, Fortnightly and Monthly, in local branch, there are two extras called One off and Adhoc, when there shouldn\u0027t be. There are no longer two extra periods. The frequencies are as they should be.\n\nTurns out you can Amend a tax return online if the period is under arrangement, as Debt Case does not lock Returns.",
        "developerNotes":  "Added comprenhensive JSON to hold default product configuration for DEBT case, notification, codes, and system constants.\n\nAlso, refactored out two tables into code types and added migration scripts.",
        "versionObject":  {
                              "minor":  1,
                              "build":  701,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Debt Case"
    },
    {
        "id":  259701,
        "version":  "3.1.698.0",
        "functionalNotes":  "There are no functional changes here.",
        "developerNotes":  "Implement UI tests for multi taxpayer access feature",
        "versionObject":  {
                              "minor":  1,
                              "build":  698,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Multi TIN access request - UI tests"
    },
    {
        "id":  259781,
        "version":  "3.1.756.0",
        "functionalNotes":  "No UI changes.",
        "developerNotes":  "Marks SetAnswerOnDetailItem as virtual in ImportHelper.cs so it can be overridden in client layer.",
        "versionObject":  {
                              "minor":  1,
                              "build":  756,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Web Tax Return Excel uploads not rounding down"
    },
    {
        "id":  259816,
        "version":  "3.1.709.0",
        "functionalNotes":  "When there is a dependent value that is in a registration question from a prior question for a particular tax type, the value is now retained when Save \u0026 Continue is clicked. This is a specific issue in a Belize Tax Type tax type registration.",
        "developerNotes":  "Add condition to handle unselected frequency in combo box\n\nEnhance the ViewInstance_ReturnFrequencyChanged method by adding a check for the SelectedIndex of the ReturnFrequencyComboBox. This ensures that the logic for pushing values back to the object and triggering the RegistrationAnswerChanged method only executes when a new instance is being added",
        "versionObject":  {
                              "minor":  1,
                              "build":  709,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "TaxType registration question losing value"
    },
    {
        "id":  259908,
        "version":  "3.1.745.0",
        "functionalNotes":  "There is now a date validation on the auto-registered ad hoc tax types when the day after taxpayer has been ceased that does not allow a return to be filed.",
        "developerNotes":  "Small fix in a calculator class",
        "versionObject":  {
                              "minor":  1,
                              "build":  745,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Date validation for auto-registered ad-hoc tax type"
    },
    {
        "id":  260047,
        "version":  "3.1.698.0",
        "functionalNotes":  "A period has a credit balance, it comprises a credit return and a payment.  This credit balance is available for a REF case, and a Refund record is created for the total balance.  Subject to configuration, this refund is eligible for credit interest to apply \"after some time\".  Once this time has passed, credit interest applies only to the core tax amount of the refund.  This is default Iho functionality.\n\nThere\u0027s a new system constant, RefundInterestAmountMode, which supports two values:\n\u0027CoreTaxOnly\u0027 is the default, and is current Iho funtionality\n\u0027ApprovedRefund\u0027 takes the amount remaining on the Refund record",
        "developerNotes":  "Added in a new system constant, and used its value to determine which method is used to find the amount against which interest applies.\n\nNote that spf_CalculateRefundInterest has been updated.  This will be a breaking change for Cyprus.\n\"Any changes made in this proc need to be applied into override Cyprus proc (spf_CalculateRefundInterest) as well.\"",
        "versionObject":  {
                              "minor":  1,
                              "build":  698,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Credit interest configuration option"
    },
    {
        "id":  260053,
        "version":  "3.1.726.0",
        "functionalNotes":  "Issues fix to ensure Bank and Bank Account fields won\u0027t show when Bank Recon feature is off",
        "developerNotes":  "Extremely minor fix in CashierReconciliationListController and Model file. UI will be hidden if client has BankRecon feature disabled.  No impact on search functionality.",
        "versionObject":  {
                              "minor":  1,
                              "build":  726,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "BankRec Feature Review - H - On Cashier Recon screen Bank and Bank Account fields should be hidden when Bank Recon feature is off "
    },
    {
        "id":  260280,
        "version":  "3.1.699.0",
        "functionalNotes":  "Issue fix that original first name was in the salutation although updated it in the CHG case",
        "developerNotes":  "Updated Case Notification Calculator to use freshly retrieved taxpayer summary object in salutation calculation, not stale one.",
        "versionObject":  {
                              "minor":  1,
                              "build":  699,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Change Registration Notification using original first name in the salutation"
    },
    {
        "id":  260342,
        "version":  "3.1.720.0",
        "functionalNotes":  "When it takes ages to load the taxpayers on a web users landing page, and then web user clicks another item, the error message no longer displays and user can keep progressing",
        "developerNotes":  "Add loading indicator and error handling for activities\n\nImplement loading UI with $.blockUI() during AJAX requests\nfor current activities. Add error handling with .fail() to\nunblock the UI and log errors if the request fails. Ensure\nthe UI is unblocked after rendering activities.",
        "versionObject":  {
                              "minor":  1,
                              "build":  720,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "View Related Contact Details - Error messages when selecting a taxpayer before the page has loaded"
    },
    {
        "id":  260445,
        "version":  "3.1.727.0",
        "functionalNotes":  "When selecting the Greek language option, the Pseudo code now correctly appears for Association Types in both the dropdown and the grid, but also around stardard areas in the grid.\n\nAssociation Types (Dropdown and grid list) - Passed\nShow entries - Passed\nSearch - Passed\nShowing x to x of x entries - Passed\nPrevious/Next - Passed",
        "developerNotes":  "Added missing translations for Iho.\n\nFix culture issue within the Association page table.",
        "versionObject":  {
                              "minor":  1,
                              "build":  727,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "View Related Contact Details - Pseudo code should for for Association Type as it does per the Back Office"
    },
    {
        "id":  260452,
        "version":  "3.1.720.0",
        "functionalNotes":  "When an association cease date has not yet been met ie Pending, then stays in Active\nWhen an association cease date has been met ie INactive, then moves to Cease tab in Online",
        "developerNotes":  "Show future ceased taxpayer relationships as active online",
        "versionObject":  {
                              "minor":  1,
                              "build":  720,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "View Related Contact Details - Association type appearing in the Ceased "
    },
    {
        "id":  260473,
        "version":  "3.1.734.0",
        "functionalNotes":  "The Association Type row is now wrapping when the relationship name is too long within Associations.",
        "developerNotes":  "Enhance taxpayerRelationshipType column rendering\n\nAdded a render function for the taxpayerRelationshipType column to format data with a text-wrap div. Removed the width property from the fullName column, which may impact its display in the data table.",
        "versionObject":  {
                              "minor":  1,
                              "build":  734,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "View Related Contact Details - Association Types column is not wrapping when the relationship name is too long"
    },
    {
        "id":  260476,
        "version":  "3.1.740.0",
        "functionalNotes":  "The Tax Return Detail Items screen should now filter on String Answer columns when the option to filter is available.",
        "developerNotes":  "The changes should be isolated to the TaxReturnItemDetailList Controller and do as the functional notes say.\n\nA side-effect that could occur could be a negligible performance difference in the screen (might see perf change for large lists). No other behaviour should change.",
        "versionObject":  {
                              "minor":  1,
                              "build":  740,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "The search text box in the Tax Return Item Details Vertical Form doesn\u0027t all visible columns."
    },
    {
        "id":  260783,
        "version":  "3.1.737.0",
        "functionalNotes":  "TPRP is working as expected according to the current iho set up. There is no change in the product.",
        "developerNotes":  "The repository methods to set the descriptions of taxpayer risk profiling rules and rule parameters have been made into virtual methods on the relevant repository so can be overridden as required by the regional developer team.",
        "versionObject":  {
                              "minor":  1,
                              "build":  737,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Configured parameter description gets overwritten after edit"
    },
    {
        "id":  260797,
        "version":  "3.1.759.0",
        "functionalNotes":  "Tin-or-name type Detail Questions NOW showing on My Request Details page",
        "developerNotes":  "Support tin/tin-or-name component answer being in json format in DataTable.vue when running display logic",
        "versionObject":  {
                              "minor":  1,
                              "build":  759,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Online Request  tin-or-name type Detail Questions not showing on My Request Details page"
    },
    {
        "id":  260865,
        "version":  "3.1.709.0",
        "functionalNotes":  "No functional changes.\nTuning to the procs to help prevent deadlocks",
        "developerNotes":  "Stored procedures were hitting deadlocks and was refactored to avoid this happening.\n\nThe stored procedure uses a readpast hint which requires readcommitted to be set. this is handled in the stored procedure but if you hit issues with integration tests there\u0027s a sample on how to get it to work in this checkin\n\nNote; this isn\u0027t an issue with the regular running as its not wrapped in a code level transaction, that only happens in integration tests",
        "versionObject":  {
                              "minor":  1,
                              "build":  709,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Prevent Bulk Processing Message Queue deadlocks"
    },
    {
        "id":  261001,
        "version":  "3.1.703.0",
        "functionalNotes":  "Issue fixes that the mandatory field was not highlighted. New mandatory question called \u0027Source of Income\u0027 has been added to individual registration and working without issue.",
        "developerNotes":  "Adding new mandatory question called \u0027Source of Income\u0027 to individual registration. \nSource code has been fixed to show yellow background/highlight on the checked list box when registration question is mandatory.",
        "versionObject":  {
                              "minor":  1,
                              "build":  703,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "REG Case Source of Income Mandatory but not highlighted"
    },
    {
        "id":  261228,
        "version":  "3.1.710.0",
        "functionalNotes":  "Case Management - the Manager field in a newly created manual case i.e. the Case tab in all cases behaves as expected. The Manager field now pre-populates with the User creating the Case.",
        "developerNotes":  "The manager defaults to the current user except when the user. \nWhen a taxpayer is selected the department will become the department of the taxpayer (current functionality).\nIf the user changes the department to a department they do not have permission, the manager will become blank.\nIf the user does not have Can Allocate permission the department and manager fields are disabled.",
        "versionObject":  {
                              "minor":  1,
                              "build":  710,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "US1 - Case Management - the default selection for \u0027Manager\u0027 field - Initial Screen "
    },
    {
        "id":  261229,
        "version":  "3.1.710.0",
        "functionalNotes":  "Case Management - the Manager field in a newly created manual case. \n\nThe department in the new case will become that of the selected taxpayer - given the user has access to this Department.\nWhen the User updates the department and they do not have access to that department, then Manager becomes Not Selected.",
        "developerNotes":  "The manager defaults to the current user except when the user. \nWhen a taxpayer is selected the department will become the department of the taxpayer (current functionality).\nIf the user changes the department to a department they do not have permission, the manager will become blank.\nIf the user does not have Can Allocate permission the department and manager fields are disabled.",
        "versionObject":  {
                              "minor":  1,
                              "build":  710,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "US2 - Case Management - Editing Manager on Initial Case Screen"
    },
    {
        "id":  261230,
        "version":  "3.1.710.0",
        "functionalNotes":  "Case Management - if the User has permissions to Allocate Cases, the Allocation tab will show in the Case.\nCase Management - if the User has permissions to Allocate Cases, the Allocation tab details will display and the User will be able to allocate the case manually to another user\n\nCase Management - if the User Does not have permissions to Allocate Cases, the Allocation tab will NOT show in the Case.\nCase Management - and as the User does not have Allocate permissions, then they cannot assign the case to another user/manager.",
        "developerNotes":  "The manager defaults to the current user except when the user. \nWhen a taxpayer is selected the department will become the department of the taxpayer (current functionality).\nIf the user does not have Can Allocate permission the manager fields are disabled.",
        "versionObject":  {
                              "minor":  1,
                              "build":  710,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "US3 - Case Management - the default selection for \u0027Manager\u0027 field in Allocation tab"
    },
    {
        "id":  261275,
        "version":  "3.1.701.0",
        "functionalNotes":  "Issue fixes that Notice of Assessment Letter was only showing one period while more than one periods are assessed",
        "developerNotes":  "changes in a report proc (spr_NoticeOfAssessment)",
        "versionObject":  {
                              "minor":  1,
                              "build":  701,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Audit Case - Notice of Assessment Letter and Proposed Notice of Assessment Letter"
    },
    {
        "id":  261352,
        "version":  "3.1.716.0",
        "functionalNotes":  "Issue fixes that previously the Email section was blank when moving back to Instalment Arrangement Confirmation Notification screen",
        "developerNotes":  "Modified the setup of the correspondence controls so while grouped on email and letter will check all the items for the correct isrequired and ismandatory settings",
        "versionObject":  {
                              "minor":  1,
                              "build":  716,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Debt Case - Emailed Notification task when revisited, shows a blank email section"
    },
    {
        "id":  261462,
        "version":  "3.1.702.0",
        "functionalNotes":  "Three tables have been added to Non-Individual Income Tax return:\nFixed Assets Table UI (to be used for CIT/PIT in Cyprus)\nTable with subtotals (to be used for CIT/PIT in Cyprus) \nTable with various data types (an example of different data types that can used within Iho v3)\n\nThe tables function correctly through Filing and Amending a return, display correctly in Submit \u0026 Review page and View Return page, and maps correctly into the Back office.",
        "developerNotes":  "This is based on details in the Table Entry Requirements document (See ticket Links)\n\nPurpose\nThis will extend tax return entry for detail questions to support \u0027table based\u0027 entry. This is additional to the current \u0027row by row\u0027 entry.\nTable based entry refers a defined set of rows and columns being preloaded and presented in a table structure.  Rows are fixed and cannot be added or removed\nImage\n\nFeatures\nEach column is configured using the normal detail question configuration\nA single flag at the question level switches to the new mode (set TaxReturnQuestion.ShowTable to true)\nThere are many advanced features \n\nConfiguration\nAll standard detail question configuration is supported\nThe only fixed requirement for the detail questions is that the first row must be a lookup. The items in this are displayed as the labels for each row. It is expected thger code tables will be used\nEach codes items can have a prefix to control formatting and add features. Examples include Header Rows, hiding individual cells and column level subtotals using specified columns (as apposed to the normal row based calculations\nPrefix tags are double square brakets [[ ]] and require json inside except fpr headings that must just have HEAD\n\nSaving\nNo changes here, these are saved as normal detail questions",
        "versionObject":  {
                              "minor":  1,
                              "build":  702,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Cyprus - CiT / PiT Online UI Design Changes"
    },
    {
        "id":  261485,
        "version":  "3.1.699.0",
        "functionalNotes":  "When the auto approval for registration notification is set to EmailAlerts, the notification now shows in back office correspondence. The email alert is sent to the web user tax agent.\n\nThe Notification itself shows Online in the Inbox for the newly created taxpayer as a system message. (and not in the inbox of the web user)",
        "developerNotes":  "Online inbox now selects correspondence records from the DB which have empty string comments if they have non null Gzipcomments.\nThe auto approved email now passes a taxpayer ID to the notification repository so it can be saved as correspondence. It also has a nasty hack around getting the email content into the Gzipped format.",
        "versionObject":  {
                              "minor":  1,
                              "build":  699,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Generic email alert doesn\u0027t show messge in online inbox"
    },
    {
        "id":  261500,
        "version":  "3.1.729.0",
        "functionalNotes":  "When it is switched to the Greek language, the \"Please select an option\" validation error message on the Upload or enter return page in the Return Wizard shows correctly translated in Pseudo code.",
        "developerNotes":  "WizardOrUpload.vue file had static text used for the error message \"Please select an option\".\nWe updated it to use resource key so that it gets translated when language is switched.\nNo side effects are expected from this change.",
        "versionObject":  {
                              "minor":  1,
                              "build":  729,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Web - \"Please select an option\" is not translated in the WizardOrUpload.vue"
    },
    {
        "id":  261582,
        "version":  "3.1.727.0",
        "functionalNotes":  null,
        "developerNotes":  null,
        "versionObject":  {
                              "minor":  1,
                              "build":  727,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Duplicate documents when multiple roles provide access to a Classification Status"
    },
    {
        "id":  261596,
        "version":  "3.1.727.0",
        "functionalNotes":  "When a return assessment has happened (either by Amending a Return or via a Return Assessment Case), when in Returns tab Back Office, click on the Print icon, the Report shows the Original Return and the Assessed Amounts in particular when it comes to when in the Assessment, answering Yes to any Zero-rated supplies and entering a value.",
        "developerNotes":  "Modified the rdl expression so checks with CBool if the value is true or false",
        "versionObject":  {
                              "minor":  1,
                              "build":  727,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Tax Return Details Report always shows no for yes/no and checkbox answers in assessment column"
    },
    {
        "id":  262038,
        "version":  "3.1.695.0",
        "functionalNotes":  "When the Multi Request feature is turned on, after entering the Activation Code the verified access page is now a web user page (not a taxpayer page) at which point of time Request Access to a taxpayer appears in the web user dropdown and View Account details correctly goes to a taxpayer page that has a link to My Taxpayers.",
        "developerNotes":  "Fix user configuration settings after taxpayer access request is verified",
        "versionObject":  {
                              "minor":  1,
                              "build":  695,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Online Multi Request Access - Your access has been verified page is a taxpayer page and arriving on View Account details has no My Taxpayers option when other taxpayers to redirect to the web user screen"
    },
    {
        "id":  262076,
        "version":  "3.1.769.0",
        "functionalNotes":  "Issue fixes that the sort order on Summary screen was incorrect",
        "developerNotes":  "Small fixes in 3 procs and a data.sql period sort order correction script",
        "versionObject":  {
                              "minor":  1,
                              "build":  769,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Multiple Ad Hoc - Sort order on Summary screen is incorrect"
    },
    {
        "id":  262091,
        "version":  "3.1.697.0",
        "functionalNotes":  "No functional change. Proc runs without error.",
        "developerNotes":  "Fix to remove configuration data proc to stop it raising errors if the config doesn\u0027t exist, instead a message is output\nThis allows it to be run multiple times",
        "versionObject":  {
                              "minor":  1,
                              "build":  697,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Remove configuration data - validation messages"
    },
    {
        "id":  262096,
        "version":  "3.1.695.0",
        "functionalNotes":  "Passed local branch testing. User can file a nil return with no multiple repetitions and date received is showing the correct date.",
        "developerNotes":  "The fix for this item is to ensure that the TaxReturnHeader is always saved when a return is saved online.\n\n\\iho-v3\\IhoApiData\\Repositories\\TaxReturn\\TaxReturnWizardRepository.cs:2565\n\nAdded taxReturnHeader.IsSavedWhenClean = true;\n\nThis is similar to the line directly above it, which set the taxReturnHeader.TaxReturn.IsSavedWhenClean = true, however, this line is meaningless without the new change, since if the tax return is clean, and the tax return header is clean, then the tax return is never attempted to be saved, whether IsSavedWhenClean is true or not.",
        "versionObject":  {
                              "minor":  1,
                              "build":  695,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Online filed nil return which replaces a nil default assessment doesn\u0027t create a tax return."
    },
    {
        "id":  262127,
        "version":  "3.1.731.0",
        "functionalNotes":  "To set up P\u0026I for multiple adhoc and standard adhoc tax types to be same as VAT",
        "developerNotes":  "Iho specific change. Adding penalty config to 2 adhoc tax types.",
        "versionObject":  {
                              "minor":  1,
                              "build":  731,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Multiple Ad Hoc - Configure penalties for multiple ad hoc tax type"
    },
    {
        "id":  262151,
        "version":  "3.1.695.0",
        "functionalNotes":  "new image is now showing based on the report signature file.",
        "developerNotes":  "Minor fix in both REG009 rdl and SimpleLetter rdl to change image source from embedded to external. No impact to client team as signature report text without the initial \"img\" will not populate any image signature.",
        "versionObject":  {
                              "minor":  1,
                              "build":  695,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Change report image source to external instead of embedded"
    },
    {
        "id":  262178,
        "version":  "3.1.695.0",
        "functionalNotes":  "No functional changes, fixes to case type deletion procedure",
        "developerNotes":  "Fixes to deleting proc for case type",
        "versionObject":  {
                              "minor":  1,
                              "build":  695,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Issue with deleting case type"
    },
    {
        "id":  262264,
        "version":  "3.1.727.0",
        "functionalNotes":  "A file added to document management via the document management module should only show up once in the document management search",
        "developerNotes":  "Modified the stored procedure to eliminate the duplicates in the SQL",
        "versionObject":  {
                              "minor":  1,
                              "build":  727,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Document Management - Adding a new document appears multiple times after save"
    },
    {
        "id":  262277,
        "version":  "3.1.736.0",
        "functionalNotes":  "Smoke tested RMS back office and weeb and no related issues found.",
        "developerNotes":  "Update all instances of GETDATE() (and equivalent) in db procs / functions etc to use fGetCurrentDate() / fGetCurrentDateUtc() so they are compatible with time shifting. Add TestNoObjectDefinitionsUsingDefaultSqlDate test to detect future instances of default sql dates to ensure these aren\u0027t re-introduced. Add fGetCurrentDateUtc() function to support current UTC date.\n\nTo the regions - We want to follow this standard in the client layers as well so a unit test should be added in the client layer which calls DataTorque.Iho.UnitTestFramework.FrameworkTests.TestNoObjectDefinitionsUsingDefaultSqlDate(). This test will inform of all instances of GETDATE() (and equivalent) in the client database and these should be replaced with fGetCurrentDate() / fGetCurrentDateUtc()",
        "versionObject":  {
                              "minor":  1,
                              "build":  736,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Web stored procedures not using the timeshifting function"
    },
    {
        "id":  262295,
        "version":  "3.1.728.0",
        "functionalNotes":  "Tax accounts are now sorted alphabetically (ASC)",
        "developerNotes":  "Update order by logic in spf_GetTaxTypesForWebUser",
        "versionObject":  {
                              "minor":  1,
                              "build":  728,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Web - Tax account dropdown should be sorted alphabetically"
    },
    {
        "id":  262373,
        "version":  "3.1.708.0",
        "functionalNotes":  "There are no UI changes.",
        "developerNotes":  "Update ReportParameter configuration to support codes more fully and allow configuration of two parameters of the same type using different codes.",
        "versionObject":  {
                              "minor":  1,
                              "build":  708,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Unable to add 2 Report Parameters of the Same Type in RMS 10"
    },
    {
        "id":  262386,
        "version":  "3.1.756.0",
        "functionalNotes":  "Announcements is now spelt correctly in the \u0027Welcome to Online Tax Services\u0027 email.",
        "developerNotes":  "Fix email template body typo for user account activation",
        "versionObject":  {
                              "minor":  1,
                              "build":  756,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Typo in User Account Activation \u0027Welcome to Online Tax Services\u0027 email"
    },
    {
        "id":  262387,
        "version":  "3.1.769.0",
        "functionalNotes":  "The GroupTaxpayer rules have not changed, they must have a valid VAT registration that is not ceased.\nThe GroupMember has not change that they need to be a non-individual\nwhat has changed is they now only really have to have a valid VAT registration that is after the GroupTaxpayer Commence Date.",
        "developerNotes":  "The GroupMembership has been changed so that it is valid to add a taxpayer to a group as long as the taxpayer has a valid tax type registration during the Groups range i.e. if the group starts 1/1/2020 and ceases 31/12/2025, then a taxpayer with a tax type registration that starts between that range can be added to the group. Note that the GroupTaxpayer validation remains as it is where the tax type registration must not be ceased to create the group.",
        "versionObject":  {
                              "minor":  1,
                              "build":  769,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "TaxRegistrationCalculator.IsTaxpayerRegisteredForTaxType allows null endDate but calculation fails if Registration has ceasedDate"
    },
    {
        "id":  262405,
        "version":  "3.1.760.0",
        "functionalNotes":  "To do with payments and the general ledger and specifically, using ac_Cash where constant value = 22 instead of the harded code value of 20000 so this will help with cash payments and reconciliations",
        "developerNotes":  "The PaymentBankAssetAccountID value should match the AccountID of the Account that represents \"Here is where we record actual cash received into RMS\". For most, this will be the same AccountID that is saved to the system constant \"ac_Cash\".\n\nPreviously, there was code that looked for this value as the default, but it searched using the account \"code\" value. This value is not guaranteed to be the same across all clients. So, we\u0027ve changed the code to use the battle-tested system constant \"ac_Cash\".\n\nThis default value will only be used if no other account can be found through the BankAssetAccountMapping table.",
        "versionObject":  {
                              "minor":  1,
                              "build":  760,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Hard coded account code in TaxpayerAccountRepository -\u003e GetPaymentBankAssetAccountID causing issues"
    },
    {
        "id":  262459,
        "version":  "3.1.754.0",
        "functionalNotes":  "N/A",
        "developerNotes":  "Add Inactive property to data definition interfaces that are missing it. Also update associated templates and configuration stored procs where this is missing. Test fixes",
        "versionObject":  {
                              "minor":  1,
                              "build":  754,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Configuration library missing inactive flag for IOnlineRequestWizardPage"
    },
    {
        "id":  262530,
        "version":  "3.1.729.0",
        "functionalNotes":  "When the taxpayer does not have any associated tax types, the web user (for the taxpayer) is still able to select the Full Access option (TIN level Tax Agent access) without any validation error message blockers.",
        "developerNotes":  "Removed the Tax Types checks to allow TIN only users to request an Agent, hiding the Tax Type selection for them (they don\u0027t have any associated Tax Type)",
        "versionObject":  {
                              "minor":  1,
                              "build":  729,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Tax Agent Online - Unable to add agent where TP is TIN only"
    },
    {
        "id":  262574,
        "version":  "3.1.700.0",
        "functionalNotes":  "Upon logging in with valid user credentials and waiting a minute, and then requesting a new 2fa code, the user stays at that 2Fa screen",
        "developerNotes":  "This change fixes a bug introduced into 2FA due to a complete refactor.",
        "versionObject":  {
                              "minor":  1,
                              "build":  700,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "2FA - Two factor authentication - upon clicking the Resend code button, webuser is taken to the Login screen when they should stay on the 2fa screen"
    },
    {
        "id":  262575,
        "version":  "3.1.711.0",
        "functionalNotes":  "When a taxpayer has cancelled their registration for adhoc auto registered and adhoc multiple auto reigstered, that on Web they cannot file a tax return as that taxpayer has ceased.\n\nFeature is called \u0027WebPreventCeasedAdhocFiling\u0027",
        "developerNotes":  "Added a feature to optionally disable showing adhoc tax types for filing on web when the taxpayer\u0027s registration cease date has been reached",
        "versionObject":  {
                              "minor":  1,
                              "build":  711,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Adhoc/Multi - Prevent taxpayers from filing returns online for tax types after their registration is no longer active."
    },
    {
        "id":  262611,
        "version":  "3.1.758.0",
        "functionalNotes":  "When refunds are under the threshold, web user can no longer request the refund online - as expected. This is in Sandbox",
        "developerNotes":  "Updated sandbox to have the modern processing service service form, set system constant to desired value.",
        "versionObject":  {
                              "minor":  1,
                              "build":  758,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Sandbox - Refunds below threshold are not automatically refunded, allowing them to be requested online."
    },
    {
        "id":  262624,
        "version":  "3.1.743.0",
        "functionalNotes":  "The PhoneListTopCountries SystemConstant configuration will be used consistently across all online phone number fields, including:\n- Online Taxpayer Registration  Contact Details\n- Online Taxpayer Registration  Association  Contact Details\n- Profile  Contact Numbers\n- Register Web Users\n- Manage User Access \u003e User Details\n\nThe standard Phone Number field will be defaulted to the client country, as set by IsDefault in the Country table. \n\nThe PhoneListTopCountries will be sorted based on the Country table sort order, before sorting alphabetically. \n  \n  \nAll other countries will be displayed in alphabetical order below the top list.",
        "developerNotes":  "Update online phone number country dropdowns to work in a consistent way. Specifically this has involved adding the GetGroupedSelectListResponseFromApi() method to BaseController as well as updating spf_GetPhoneCodes and Dropdown.vue for the online request framework",
        "versionObject":  {
                              "minor":  1,
                              "build":  743,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Phone number country drop-down controls have inconsistent behaviour"
    },
    {
        "id":  262705,
        "version":  "3.1.710.0",
        "functionalNotes":  "Issue fixes that previously the return question of dropdown look up was not populated up in NOA",
        "developerNotes":  "Added updating the ReturnItemLookUpText and the AssessmentItemLookUpText in the SaveTaxReturnItemsInBulk method and Updated the Report to view reference this field if the Return/AssessmentText is blank for a dropdown. This will need to be implemented in the Belize reports and other client layers  to view.",
        "versionObject":  {
                              "minor":  1,
                              "build":  710,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "TaxReturn Dropdown Code not populated in TaxReturnItem ReturnLookupText column"
    },
    {
        "id":  262729,
        "version":  "3.1.708.0",
        "functionalNotes":  "Filing VAT return in SysTest works with no issue. Client needs to test their configuration. Dev has configured the Tax return question with default value in local branch and was tested there and passed.",
        "developerNotes":  "Reset default values for return questions that are hidden and reshown again by calling common mixin doCalc function when question defaulter property is present and question is unhidden from visible conditions",
        "versionObject":  {
                              "minor":  1,
                              "build":  708,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "TaxReturn Online Question default value being cleared out"
    },
    {
        "id":  262730,
        "version":  "3.1.699.0",
        "functionalNotes":  "Able to have a line break in Signature name to enable clients to do this when it is deemed too long in a TAX003 Request to access your taxpayer account notification.",
        "developerNotes":  "Allow html markup for signature in TAX 003 report",
        "versionObject":  {
                              "minor":  1,
                              "build":  699,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Fix TAX 003 signature field markup type"
    },
    {
        "id":  262759,
        "version":  "3.1.711.0",
        "functionalNotes":  "A web user can initiate, send and have access to an ENQ message from RMS Inbox for any tax type, year, or period, regardless of:\nThe tax types the user is registered for, or\nThe tax types the user has been granted access to.",
        "developerNotes":  "A web user can initiate, send and have access to an ENQ message from RMS Inbox for any tax type, year, or period, regardless of:\nThe tax types the user is registered for, or\nThe tax types the user has been granted access to.",
        "versionObject":  {
                              "minor":  1,
                              "build":  711,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Message does not appear in Inbox if the taxpayer does not have active registration to the tax type"
    },
    {
        "id":  262819,
        "version":  "3.1.747.0",
        "functionalNotes":  "no functional changes",
        "developerNotes":  "ImportFileStatus \nAdded new enum to match with db \u0026 update existing ones with new value - no impact if client is using enum string instead of value for their BankStatementImport process. Otherwise, update to use enum string instead. \nImportFileDetailStatus \nAdded new enum to match with db \u0026 update existing ones with new value except Failed code - the previous Failed code is now updated to ImportFailed. This require updates by client if they are using it.",
        "versionObject":  {
                              "minor":  1,
                              "build":  747,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "BankRec - L - Fix enum to match with db table values"
    },
    {
        "id":  262904,
        "version":  "3.1.708.0",
        "functionalNotes":  "When displaying Return Detail Answers of type percent online, if the selected culture uses a comma as the decimal separator, these values are now displayed correctly instead of 0%. \nFor example, a \"Tax Rate %\" detail question value of 5% in Greek, was incorrectly displayed as 0%.",
        "developerNotes":  "When displaying Return Detail Answers of type percent online, if the selected culture uses a comma as the decimal separator, the JS function DTCore.js TryParseFlaot() used to parse the JSON value, failed to recognise it as a valid number. This is fixed by replacing \",\" with \".\" in this function.\nNote that javascript does not natively support a thousand separator, nor any char other than \".\" as the decimal separator, including when the OS / Browser culture does.\nGoing forward, developers should try to use an alternative function to this that takes in the current culture when trying to parse a numeric value from a string depending on the source of the value.",
        "versionObject":  {
                              "minor":  1,
                              "build":  708,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Formatting Percent Type Detail Question Online for cultures with Comma Decimal Seperator"
    },
    {
        "id":  262914,
        "version":  "3.1.706.0",
        "functionalNotes":  "Iho only script changes - no changes affecting the regions",
        "developerNotes":  "Updating Iho only script - we were deactivating some report data but assuming its active in the first place which it doesn\u0027t seem to be in that database\n\nAdded a check around the spt call to make sure we\u0027re only calling it if its active.",
        "versionObject":  {
                              "minor":  1,
                              "build":  706,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "One of our scripts isn\u0027t safe in version  Version 3.1.687.0 - Internal Training Environement Deployment 3.1.700.0"
    },
    {
        "id":  263027,
        "version":  "3.1.727.0",
        "functionalNotes":  null,
        "developerNotes":  null,
        "versionObject":  {
                              "minor":  1,
                              "build":  727,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Multiple Ad Hoc - Period Dropdown - 2"
    },
    {
        "id":  263028,
        "version":  "3.1.727.0",
        "functionalNotes":  null,
        "developerNotes":  null,
        "versionObject":  {
                              "minor":  1,
                              "build":  727,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Multiple Ad Hoc - Period Dropdown - 3"
    },
    {
        "id":  263102,
        "version":  "3.1.721.0",
        "functionalNotes":  "Changes made for UI to disable some fields when adjust a payment while it\u0027s been cashier reconciled/payment made from bank recon adjustment/Matched Payment/Bank Reconciled Payment",
        "developerNotes":  "added new payment calculator method - IsPaymentControlActionBlocked, this is used to determine if certain payment controls action is blocked for cashier recon/bank recon related payment during payment adjustment. Changes applied to client as part of standard product behavior.",
        "versionObject":  {
                              "minor":  1,
                              "build":  721,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Overall blocked actions in Pay In (Edit) Form"
    },
    {
        "id":  263115,
        "version":  "3.1.709.0",
        "functionalNotes":  "Last logged in date/time is appearing in the DD/MM/YYYY format as expected for SEC001 report.",
        "developerNotes":  "Applied standard short datetime formatting to datetime fields.",
        "versionObject":  {
                              "minor":  1,
                              "build":  709,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "SEC 001 report date formatting is incorrect"
    },
    {
        "id":  263119,
        "version":  "3.1.707.0",
        "functionalNotes":  "n/a",
        "developerNotes":  "n/a",
        "versionObject":  {
                              "minor":  1,
                              "build":  707,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Test Data Generator: Individuals aren\u0027t being populated by the test data generator"
    },
    {
        "id":  263236,
        "version":  "3.1.736.0",
        "functionalNotes":  "When a \u0027Request for Information\u0027 task has the TaskTimeSpent = 1, the Time Spent field needs to have a yellow background to indicate it is mandatory",
        "developerNotes":  "The optional tasks did not update the background colour when made mandatory, the check validating that the the ID \u003e 0 was changed to (ID \u003e0 || Adhoc), this still validates correctly for case workflow items but also allows the optional task to be updated.",
        "versionObject":  {
                              "minor":  1,
                              "build":  736,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "The \u0027Time Spent on Task\u0027 textbox is not updating its required field color after being set as mandatory"
    },
    {
        "id":  263244,
        "version":  "3.1.730.0",
        "functionalNotes":  "Intermittent privacy issue resolved where a taxpayer would receive a notification addressed to another taxpayer.",
        "developerNotes":  "Made report render no longer inherit ReportExecutionService, but have an instance of it as a local variable to prevent singleton cross thread access. Added integration test to validate correct report returned.",
        "versionObject":  {
                              "minor":  1,
                              "build":  730,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Reports generated with the incorrect details"
    },
    {
        "id":  263446,
        "version":  "3.1.718.0",
        "functionalNotes":  "Issue fixes to save AgentAssignmentChanged in taxpayer correspondence",
        "developerNotes":  "Changed the TaxpayerNotificationConfiguration in the DB so that triggers the correct notifications, also changed the NotificationRepository to check that is the TaxpayerNotificationConfiguration is AgentAssignmentChanged that requires a taxpayer to save the correspondence",
        "versionObject":  {
                              "minor":  1,
                              "build":  718,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "[Bug] Inconsistent behaviour when saving correspondence record for tax agent notifications"
    },
    {
        "id":  263482,
        "version":  "3.1.713.0",
        "functionalNotes":  "No functional change, only updating SUSR cases to be accessible in PR deployments, via performing a change in Integration Test DB.",
        "developerNotes":  "Test files have been updating to refresh Caching when running their related tests. Integration Test DB changes to allow SUSR cases to be created.",
        "versionObject":  {
                              "minor":  1,
                              "build":  713,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Local Branch Testing - SUSR Case Related changes"
    },
    {
        "id":  263493,
        "version":  "3.1.730.0",
        "functionalNotes":  "The Cancel button is only required to clicked once (as the validation error messages now only fire when Verify Access has been clicked) and it directs the user the Request management page.",
        "developerNotes":  "Update verify taxpayer access page to only perform validation on form submission as requested by the business. Update cancel button redirect route",
        "versionObject":  {
                              "minor":  1,
                              "build":  730,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Multi TIN access request - Verify access to a taxpayer page requires the cancel button to be clicked twice as the validation error message comes up first"
    },
    {
        "id":  263501,
        "version":  "3.1.737.0",
        "functionalNotes":  "Corrections have been made to the Taxpayer access request email. The heading now displays Taxpayer spelt correctly while a full stop has been added to the first sentence that is written in bold.",
        "developerNotes":  "Fixed typo on both code and data. Updated words from taypayer to taxpayer.\n\nClient might need to change some resource files, please have a look at the files changed on the PR.",
        "versionObject":  {
                              "minor":  1,
                              "build":  737,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "[Bug] Single/Multi TIN access request - Taxpayer access request email - Email has some errors"
    },
    {
        "id":  263509,
        "version":  "3.1.757.0",
        "functionalNotes":  "n/a",
        "developerNotes":  "n/a",
        "versionObject":  {
                              "minor":  1,
                              "build":  757,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Backoffice webuser created with linked taxpayer, log in on website and verify taxpayer shows"
    },
    {
        "id":  263510,
        "version":  "3.1.757.0",
        "functionalNotes":  "n/a",
        "developerNotes":  "n/a",
        "versionObject":  {
                              "minor":  1,
                              "build":  757,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Create webuser through website and request access to TIN via website, get code from db and verify in BO and Web that taxpayer is added"
    },
    {
        "id":  263511,
        "version":  "3.1.757.0",
        "functionalNotes":  "n/a",
        "developerNotes":  "n/a",
        "versionObject":  {
                              "minor":  1,
                              "build":  757,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Create webuser with no taxpayer, add taxpayer via TP reg, confirm it\u0027s linked in BO/web"
    },
    {
        "id":  263512,
        "version":  "3.1.757.0",
        "functionalNotes":  "n/a",
        "developerNotes":  "n/a",
        "versionObject":  {
                              "minor":  1,
                              "build":  757,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Make a payment via Web, confirm it shows in BO"
    },
    {
        "id":  263513,
        "version":  "3.1.757.0",
        "functionalNotes":  "n/a",
        "developerNotes":  "n/a",
        "versionObject":  {
                              "minor":  1,
                              "build":  757,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "File a return via Web, confirm it shows in BO with correct details"
    },
    {
        "id":  263514,
        "version":  "3.1.757.0",
        "functionalNotes":  "n/a",
        "developerNotes":  "n/a",
        "versionObject":  {
                              "minor":  1,
                              "build":  757,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "File BO return, confirm it shows in web"
    },
    {
        "id":  263515,
        "version":  "3.1.757.0",
        "functionalNotes":  "n/a",
        "developerNotes":  "n/a",
        "versionObject":  {
                              "minor":  1,
                              "build":  757,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Make a payment via BO, confirm it shows in web"
    },
    {
        "id":  263517,
        "version":  "3.1.765.0",
        "functionalNotes":  "n/a",
        "developerNotes":  "n/a",
        "versionObject":  {
                              "minor":  1,
                              "build":  765,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "OBJ case created via web, displays correctly in BO"
    },
    {
        "id":  263518,
        "version":  "3.1.765.0",
        "functionalNotes":  "n/a",
        "developerNotes":  "n/a",
        "versionObject":  {
                              "minor":  1,
                              "build":  765,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Enquiry/Message syncing"
    },
    {
        "id":  263519,
        "version":  "3.1.765.0",
        "functionalNotes":  "n/a",
        "developerNotes":  "n/a",
        "versionObject":  {
                              "minor":  1,
                              "build":  765,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Backoffice attachments accessible via Web"
    },
    {
        "id":  263520,
        "version":  "3.1.765.0",
        "functionalNotes":  "n/a",
        "developerNotes":  "n/a",
        "versionObject":  {
                              "minor":  1,
                              "build":  765,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Changes to taxpayer details between Web/BO"
    },
    {
        "id":  263521,
        "version":  "3.1.765.0",
        "functionalNotes":  "n/a",
        "developerNotes":  "n/a",
        "versionObject":  {
                              "minor":  1,
                              "build":  765,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Web attachments accessible via BO"
    },
    {
        "id":  263533,
        "version":  "3.1.730.0",
        "functionalNotes":  "Disabled a Registration questions relating to Data Migration in particular.",
        "developerNotes":  "Introduced IsAlwaysLocked property in RegistrationQuestion to allow always disabled questions.",
        "versionObject":  {
                              "minor":  1,
                              "build":  730,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Locked checkbox registration question doesn\u0027t show correct value on Browse"
    },
    {
        "id":  263535,
        "version":  "3.1.700.0",
        "functionalNotes":  null,
        "developerNotes":  null,
        "versionObject":  {
                              "minor":  1,
                              "build":  700,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "RMSSandbox - LogError table - silent errors"
    },
    {
        "id":  263540,
        "version":  "3.1.754.0",
        "functionalNotes":  "When the configuration is setup to utilise it, fields in the new return detail UI can be locked",
        "developerNotes":  "Applying lock child functionality to the new detail UI",
        "versionObject":  {
                              "minor":  1,
                              "build":  754,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "DefenceTax - The Enhanced Grid in the Back Office Tax Returns to support Locked (disabled) Detail Questions"
    },
    {
        "id":  263556,
        "version":  "3.1.727.0",
        "functionalNotes":  "When refreshing at the Resubmit the form page and then clicking Continue, it takes you straight through to the web user page no longer allowing a duplication of the request.",
        "developerNotes":  "Prevent double submission of taxpayer access request. This is detected in TaxpayerAccessMiddleware and will redirect to the landing page in this case",
        "versionObject":  {
                              "minor":  1,
                              "build":  727,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Multi TIN access request - Able to duplicate requests by using back and forward browser and then refreshing"
    },
    {
        "id":  263560,
        "version":  "3.1.713.0",
        "functionalNotes":  "It will now correctly run the generic rules based on configuration, including the client procedure that allows override of a \"yes\" result with \"no\".",
        "developerNotes":  "Refactor of rules done for Pull had not been correctly applied to the already completed Push.\n\nNote that this requires the client version of spf_IsCreditEligibleForTransfer_Client to be applied to the DB, where it exists, updated with the new columns.",
        "versionObject":  {
                              "minor":  1,
                              "build":  713,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Auto credit transfer - Not allowing to run custom rule for eligibility"
    },
    {
        "id":  263562,
        "version":  "3.1.720.0",
        "functionalNotes":  "Internal ticket for Sandbox where Legal Status label and field are not duplicated",
        "developerNotes":  "Inactived a case task question that was inactive in ihov3",
        "versionObject":  {
                              "minor":  1,
                              "build":  720,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Sandbox - Debt Case (DBT) - Legal Status task - a duplication of Legal Status: label and dropdown"
    },
    {
        "id":  263573,
        "version":  "3.1.712.0",
        "functionalNotes":  "Permission settings to match FS",
        "developerNotes":  "Removed approve own case permission from DBS",
        "versionObject":  {
                              "minor":  1,
                              "build":  712,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "DBT Permissions - The Debt Supervisor should not able to approve their own debt cases"
    },
    {
        "id":  263575,
        "version":  "3.1.775.0",
        "functionalNotes":  "Issue fixes that previously there was an error appears when assess the return on TAC screen where optional Notes were added earlier",
        "developerNotes":  "The changes should not impact functionality. \n\nChanges should impact only cases.\nIn particular, ad-hoc tasks. The only risk is other non-serialisable fields are needed and will need to be manually added when discovered.",
        "versionObject":  {
                              "minor":  1,
                              "build":  775,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Ad-hoc tasks - TaxReturn design is removed"
    },
    {
        "id":  263599,
        "version":  "3.1.712.0",
        "functionalNotes":  "Permission settings to match FS",
        "developerNotes":  "Removed add case permission from DBO",
        "versionObject":  {
                              "minor":  1,
                              "build":  712,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "DBT Permissions - The Debt Officer should not be able to manually create a debt case"
    },
    {
        "id":  263602,
        "version":  "3.1.719.0",
        "functionalNotes":  "Users cannot edit and save changes in the Case Selection criteria descriptions in the Case tab once a Case has been auto selected",
        "developerNotes":  "Set the Case Selection Reasons Grid to Read Only",
        "versionObject":  {
                              "minor":  1,
                              "build":  719,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Case Management UI Officers should not be able to edit case tab details"
    },
    {
        "id":  263633,
        "version":  "3.1.726.0",
        "functionalNotes":  "When the OnlineTaxpayerRegistration is disabled, the Register a New Taxpayer is no longer displaying in the user account menu when the Multi TP Reg feature flag is turned on.",
        "developerNotes":  "Only show online TPREG menu item when OnlineTaxpayerRegistrationEnabled system constant is turned on",
        "versionObject":  {
                              "minor":  1,
                              "build":  726,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Multi TP Reg - When Multi TP Reg feature flag is turned on, but the OnlineTaxpayerRegistration is disabled, the Register a New Taxpayer still appears in the Web user account menu dropdown when it shouldn\u0027t"
    },
    {
        "id":  263647,
        "version":  "3.1.726.0",
        "functionalNotes":  "When the registration role assigned is not selected, the Request Access to a Taxpayer feature is still available whether it is to merely start one or there is already an active request.",
        "developerNotes":  "Only show online TPREG menu item when OnlineTaxpayerRegistrationEnabled system constant is turned on",
        "versionObject":  {
                              "minor":  1,
                              "build":  726,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Multi TIN access request - When Registration role assigned is not selected, it does not allow Request Access to a Taxpayer when it should"
    },
    {
        "id":  263657,
        "version":  "3.1.721.0",
        "functionalNotes":  "Account Adjustments now trigger the auto credit transfer process.",
        "developerNotes":  "Account adjustments have an effect on the amount that can be transferred automatically, although they do not directly contribute to the amount available for transfer.\nA debit account adjustment will increase the debt in a period and therefore decrease the available credit.\nA credit account adjustment will decrease the debt in a period and therefore increase the available credit.\n\nProcessing an account adjustment did not correctly reverse / apply auto credit transfers.  The ACT methodology has been refactored to do this without changing the behaviour elsewhere.\n\nClients will now see accounts affected when an account adjustment occurs in a period within an auto credit transfer chain.",
        "versionObject":  {
                              "minor":  1,
                              "build":  721,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Auto Credit Transfer - Amend the period where trigger FinalAction makes transferred credits reversed"
    },
    {
        "id":  263669,
        "version":  "3.1.700.0",
        "functionalNotes":  null,
        "developerNotes":  null,
        "versionObject":  {
                              "minor":  1,
                              "build":  700,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Sandbox - Debt Case (DBT) - Audit Case (ADT) - a debt case is not automatically generated"
    },
    {
        "id":  263688,
        "version":  "3.1.711.0",
        "functionalNotes":  "n/a",
        "developerNotes":  "n/a",
        "versionObject":  {
                              "minor":  1,
                              "build":  711,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "TC pipeline failure due to referencing missing file"
    },
    {
        "id":  263710,
        "version":  "3.1.716.0",
        "functionalNotes":  "Only specific Taxtype assigned agents can see the relevant RMS Web notifications. EG. only VAT agent can see VAT notifications. PAYE is unable to see.",
        "developerNotes":  "Enhance access control to online conversations\n\nAdded LEFT JOIN to #AccessibleTaxpayerTaxTypeIDs to filter conversations based on user access to specific tax types.\n\nImplemented conditions to ensure only relevant conversations are displayed.",
        "versionObject":  {
                              "minor":  1,
                              "build":  716,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Non VAT Tax Agent can see the VAT ONLY Tax notification"
    },
    {
        "id":  263727,
        "version":  "3.1.713.0",
        "functionalNotes":  "No functional changes, just changes to json template files",
        "developerNotes":  "Updated json template files following adding inactive to some and change tax type json files to remove fields\n\nused json converter tool to auto generate them",
        "versionObject":  {
                              "minor":  1,
                              "build":  713,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Sync JSON Config Templates"
    },
    {
        "id":  263756,
        "version":  "3.1.737.0",
        "functionalNotes":  "User can still file Debit and Credit return without issues",
        "developerNotes":  "Added Iho default in Iho-Only.sql and Client default in data.sql",
        "versionObject":  {
                              "minor":  1,
                              "build":  737,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "New GL Effective date function doesn\u0027t use the default configuration"
    },
    {
        "id":  263812,
        "version":  "3.1.731.0",
        "functionalNotes":  "The description of a document added via document management should display when it is saved and reopened",
        "developerNotes":  "minor fix to update Resource description from parent Documentation object",
        "versionObject":  {
                              "minor":  1,
                              "build":  731,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Document Management - Description text not saved when uploading a document"
    },
    {
        "id":  263857,
        "version":  "3.1.727.0",
        "functionalNotes":  "Ensuring VAT return design is samey samey",
        "developerNotes":  "Iho only change that updates iho config to match iho database: No functional changes noted.",
        "versionObject":  {
                              "minor":  1,
                              "build":  727,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "v3 - 2014 VAT form has some incompatibility issues between Iho v3 and Sandbox"
    },
    {
        "id":  263917,
        "version":  "3.1.735.0",
        "functionalNotes":  "An email address now requires a @ and . followed by a letter to be (RegEx) validated in the BO. This is now in line with how Online works.",
        "developerNotes":  "Modified the BackOffice to use the same RegEx to validate email addresses as per the the Web, There may be issues with clients if they have allowed internal emails of the format \u003cname\u003e@\u003cserver\u003e i.e. doesnt have the domain \u003cname\u003e@\u003cservice\u003e.\u003cdomain\u003e",
        "versionObject":  {
                              "minor":  1,
                              "build":  735,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Inconsistent verification between back office and online"
    },
    {
        "id":  263926,
        "version":  "3.1.715.0",
        "functionalNotes":  "Issue fixes to ensure period is showing when sending a web user lever message",
        "developerNotes":  "Removed logic re Taxpayer cause it is not relevant any more to retrieve periods",
        "versionObject":  {
                              "minor":  1,
                              "build":  715,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "When creating a New Message, web user (not at the taxpayer level) can\u0027t select a Period"
    },
    {
        "id":  263943,
        "version":  "3.1.714.0",
        "functionalNotes":  "The system truncates any input that exceeds 255 characters. The field prevents users from entering or pasting text beyond the allowed limit. Validation applies consistently to Post Office Box, Address Line 1, and Address Line 2.",
        "developerNotes":  "The system truncates any input that exceeds 255 characters. The field prevents users from entering or pasting text beyond the allowed limit. Validation applies consistently to Post Office Box, Address Line 1, and Address Line 2.",
        "versionObject":  {
                              "minor":  1,
                              "build":  714,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Security Issue - Unrestricted Input Length in Address Field  Potential Buffer Overflow and Application Instability (See page 7 in attachments)"
    },
    {
        "id":  263966,
        "version":  "3.1.715.0",
        "functionalNotes":  "Changed bootstrap javascript library version from 4.5.0 to  4.6.2 to address security issues",
        "developerNotes":  "Changed bootstrap javascript library version from 4.5.0 to  4.6.2 to address security issues",
        "versionObject":  {
                              "minor":  1,
                              "build":  715,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Outdated Bootstrap 4.5.0  Cross-Site Scripting Vulnerability Present"
    },
    {
        "id":  263968,
        "version":  "3.1.718.0",
        "functionalNotes":  "Changing the moment library to luxon\n\nThis affects all parts of the web where dates are displayed and input",
        "developerNotes":  "Changing the moment library to luxon\n\nThis will require changes on client layers for any places moment is used, it will need to be replaced\n\nThis affects all parts of the web where dates are displayed and input\n\nA migration guide document is available here\n\nhttps://datatorque.sharepoint.com/sites/RMSProduct/Shared%20Documents/General/Product%20Documents/Moment%20to%20Luxon%20Conversion.docx?web=1\n\n\nTo find if you need changes, the easiest thing to is search your web project for moment(\n\nkey step\nsearch for moment.js - replace with luxon.js\nsearch for moment( and replace with helper methods in dtcore.js\n--\u003e toLuxonDate  -- used for date with out format\n--\u003e parseLuxonDateWithFormat used for dates with formats\n\n\nMost common upgrade path\nThe most common upgrade path will just be replacing moment.js with luxon.js in any checked in files in the solution\nOther migration steps would only be needed if the website has custom files with custom date handling. That shouldnt be many projects.\n\n\n\n\nIf you have any local files with that, you\u0027ll need to make changes as the moment library has been fully removed",
        "versionObject":  {
                              "minor":  1,
                              "build":  718,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Deprecated Moment.js 2.29.4  Regular Expression Denial of Service (ReDoS Neil - P3)"
    },
    {
        "id":  263978,
        "version":  "3.1.715.0",
        "functionalNotes":  "Ui re the disclaimer statement. Alignment of disclaimer - to be directly underneath Year and Tax Type",
        "developerNotes":  "Ui re the disclaimer statement. Alignment of disclaimer - to be directly underneath Year and Tax Type, and Future tax period toggle if visible",
        "versionObject":  {
                              "minor":  1,
                              "build":  715,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Adhoc/Multi - Disclaimer display needs to appear as per mock-up"
    },
    {
        "id":  264050,
        "version":  "3.1.729.0",
        "functionalNotes":  "No specific Functional changes in main RMS database",
        "developerNotes":  "Updated Integration test DB to haved two features turned on (TPRP and Management Dashboard)",
        "versionObject":  {
                              "minor":  1,
                              "build":  729,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Local Branch Testing - enable TPRP and Management Dashboard Features."
    },
    {
        "id":  264064,
        "version":  "3.1.719.0",
        "functionalNotes":  "No console errors relating to Add Details in the WHD tax return",
        "developerNotes":  "Fix for console errors that were appearing when navigating to \u0027Show Details\u0027 on online returns - particularly when adding the first item.",
        "versionObject":  {
                              "minor":  1,
                              "build":  719,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "withholding tax return in the web, if you go into the detail you get an error"
    },
    {
        "id":  264067,
        "version":  "3.1.730.0",
        "functionalNotes":  "Within the notification the sort order is by Tax Type, year and period i.e. chronological and not alphabetical",
        "developerNotes":  "Sorted by period sort order, not period description.",
        "versionObject":  {
                              "minor":  1,
                              "build":  730,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Case Letters have periods in alphabetical instead of chronological order"
    },
    {
        "id":  264069,
        "version":  "3.1.748.0",
        "functionalNotes":  "Not Required returns will now not be listed as Online in the Overdue tab.",
        "developerNotes":  "Add @ExcludeNotRequired parameter to spf_GetTaxpayerNonFiledReturnList to allow filtering out returns not marked as required",
        "versionObject":  {
                              "minor":  1,
                              "build":  748,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "RET - Returns marked as \u0027Not Required\u0027 are showing online as \u0027Overdue\u0027"
    },
    {
        "id":  264072,
        "version":  "3.1.731.0",
        "functionalNotes":  "Doc Management results should auto-refresh after deleting/editing a document.",
        "developerNotes":  "minor UI refresh fix",
        "versionObject":  {
                              "minor":  1,
                              "build":  731,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Error on clicking deleted documents in Document Management"
    },
    {
        "id":  264116,
        "version":  "3.1.742.0",
        "functionalNotes":  "When displaying Return Detail Answers of type percent online, these values are now displayed correctly instead of 0%. \nFor example, a \"Tax Rate %\" detail question value of 12.5% in Greek, was incorrectly displayed as 0%.",
        "developerNotes":  "When displaying Return Detail Answers of type percent online, if the selected culture uses a comma as the decimal separator, the JS function DTCore.js TryParseFlaot() used to parse the JSON value, failed to recognise it as a valid number. This is fixed by replacing \",\" with \".\" in this function.\nNote that javascript does not natively support a thousand separator, nor any char other than \".\" as the decimal separator, including when the OS / Browser culture does.\nGoing forward, developers should try to use an alternative function to this that takes in the current culture when trying to parse a numeric value from a string depending on the source of the value.",
        "versionObject":  {
                              "minor":  1,
                              "build":  742,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Formatting Percent Type Detail Question Online for cultures with Comma Decimal Seperator"
    },
    {
        "id":  264198,
        "version":  "3.1.758.0",
        "functionalNotes":  "The Year field is now enabled when selecting Make a Payment or Pay Now from Tax Accounts when MultiplePaymentsEnabled is set to false and a tax type is web enabled but does not have a tax return design enabled.",
        "developerNotes":  "Retrieve payment tax types instead of return tax types when user tries to pay.",
        "versionObject":  {
                              "minor":  1,
                              "build":  758,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Pay Now from Tax Accounts doesn\u0027t populate Year dropdown"
    },
    {
        "id":  264204,
        "version":  "3.1.751.0",
        "functionalNotes":  "issue fixes that previously the validation incorrectly applied when adding a new group that the controller was in the deleted group",
        "developerNotes":  "minor fix on group registration screen",
        "versionObject":  {
                              "minor":  1,
                              "build":  751,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "System Prevents Group Creation Using Controller from Deleted Group"
    },
    {
        "id":  264286,
        "version":  "3.1.720.0",
        "functionalNotes":  "Issue fix to show readable text in uploading error message for Greek",
        "developerNotes":  "UTF-8 issue with excel and CSV files. Web XML Return upload\u0027s validation messages \u0027Export to CSV\u0027 downloaded csv files, were not readable in excel. Adding byte order mark BOM=true so excel knows to use UTF-8 detection.\nGreek text is now readable in excel.",
        "versionObject":  {
                              "minor":  1,
                              "build":  720,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "RMS Web \u0027Export to CSV\u0027 is downloading Greek text incorrectly encoded."
    },
    {
        "id":  264300,
        "version":  "3.1.726.0",
        "functionalNotes":  "Once an Ad hoc Multiple return has been filed, the sequential number appears for an Ad hoc return filed on the same day.",
        "developerNotes":  "Changes throughout the tax period repository to either clear cache preemptively or to double check null searches with a cache clear when using multi ad hoc periods.",
        "versionObject":  {
                              "minor":  1,
                              "build":  726,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Disable Caching for Multiple Ad-Hoc Periods"
    },
    {
        "id":  264321,
        "version":  "3.1.720.0",
        "functionalNotes":  "Issue fixes that previously the email was not sent to agent when removing an agent",
        "developerNotes":  "Fix SQL script for taxpayer agent notifications to make sure recipient\u0027s email is not empty\n\nChanged INNER JOIN on vwTaxpayerEmail to LEFT JOIN.\nAdded checks in WHERE clause to ensure recipient\u0027s email is not empty.",
        "versionObject":  {
                              "minor":  1,
                              "build":  720,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Agent Assignment Online - No email sent out when removing an agent"
    },
    {
        "id":  264423,
        "version":  "3.1.732.0",
        "functionalNotes":  "Multiple sources of automatic credit transfers are available for configuration.  There is no UserInterface for this, it is not something that clients should change.\n\nSpreadsheet / json configuration changes are supported.",
        "developerNotes":  "The flag IsOriginACreditReturn on CreditTransferChain is no longer sufficient.  It is necessary to support other (configurable) sources of automatic credit transfers.\n\nThere is a new standard lookup table, CreditTransferChainOrigin, that holds the allowed sources, whether they are eligible, and the order in which they are processed if on the same effective date.\n\nIho defaults to only Credit Return, Manual Credit Transfer, and Credit Account Adjustment being eligible.\n\nSource transactions are handled and transferred individually, within their own chains, and follow the same rules.",
        "versionObject":  {
                              "minor":  1,
                              "build":  732,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Auto Credit Transfer enhancement - multiple configurable sources - #1 - schema changes"
    },
    {
        "id":  264424,
        "version":  "3.1.732.0",
        "functionalNotes":  "Push auto credit transfers will include more sources of credit, based on configuration.\n\nNote that the flag CannotHaveAnAuditCase on TaxTypeAutoCreditTransferConfiguration has been extended to also apply to Objection and Appeal cases.  It already applied to Audit and Assessment cases.",
        "developerNotes":  "Implementation of the schema changes in 264423 for Push, including prevention of Pull erroring if picked up prior to completion of 264425 or 264426, as applicable.\n\nNow tests for more sources of credit if so configured, processing them in the correct order.\n\nNote that:\nAccount Adjustment processing had to be amended to do penalties and post-penalty procedures after the AA was created.\nCredit Transfer processing had to be amended to do penalties and post-penalty procedures after the CT was updated with the General Ledger Transaction ID.",
        "versionObject":  {
                              "minor":  1,
                              "build":  732,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Auto Credit Transfer enhancement - multiple configurable sources - #2 - push changes"
    },
    {
        "id":  264425,
        "version":  "3.1.759.0",
        "functionalNotes":  "Lots of new configuration options available for credit transfer pull in line with prior changes to push\nSee credit transfer documentation for full list of changes",
        "developerNotes":  "New configuration options for credit transfer pull",
        "versionObject":  {
                              "minor":  1,
                              "build":  759,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Auto Credit Transfer enhancement - multiple configurable sources - #3 - pull (intended) changes"
    },
    {
        "id":  264426,
        "version":  "3.1.752.0",
        "functionalNotes":  "Changes to the pull functionality to support multiple new sources. this is driven by configuration and the default configuration will match existing functionality",
        "developerNotes":  "Changes to the pull functionality to support multiple new sources\n\nEnhancements to the test step helper classes in the IhoUnitTestFramework to allow for easier creation of tests using TestStep and the TestStepHelper\n\nSee some examples under push and pull tests in Iho",
        "versionObject":  {
                              "minor":  1,
                              "build":  752,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Auto Credit Transfer enhancement - multiple configurable sources - #4 - pull (pay off) changes"
    },
    {
        "id":  264427,
        "version":  "3.1.732.0",
        "functionalNotes":  "To restate the purpose of this change.  Some case types prevent a credit in a period within the scope of the case from being automatically transferred.  Once the case is closed, credits are available and should be processed without waiting for the next financial interaction.\n\nCase closure is considered too late, instead it should be at the point of unlocking the period, if the case type is one which locks the period (DBT is an example of a case type that does not).  Case Types that do not lock the period must wait until closure, there is no other indicator that the case is not a blocker for auto credit transfer.\n\nUnlocking a period within a case will trigger auto credit transfer, but only if:\n    Credit transfers are configured for the tax type / return frequency\n    At least one of the configuration flags CannotHaveAnAuditCase or CannotHaveARefundCase are set to 1\n    The locking reason for the tax return included a Case Type abbreviation for a case type that a flag of 1 refers to\n\nClosing a case will trigger auto credit transfers for all periods within the scope of the case, but only if:\n    Credit transfers are configured for the tax type / return frequency\n        The configuration flag CannotHaveADebtCase is set to 1, and\n        The case type is one that the flag of 1 refers to, i.e. DBT, or\n\n        The configuration flag CannotHaveUnpresentedRefund is set to 1, and\n        The case type is one that the flag of 1 refers to, i.e. RFD, and\n        The Refund record has no amount left to disburse",
        "developerNotes":  "The processing order of cases is not what might be expected.  Consider an Audit case.  Taxpayer Account Changes are made, submitted for approval, approved, and Save and Continue clicked.  At this point the tax return and general ledger tables are updated, penalties recalculated.  Auto credit transfer won\u0027t happen, because the case is open and the return is locked.  Once the return is unlocked, it will attempt to process auto credit transfer, but when is the tax return unlocked?\n\nThe expectation is that it\u0027s at this point, when the changes have been saved.  That turns out not to be the case.  It\u0027s not until the case is closed.  The Case is set to Closed, periods within scope are unlocked, the spf_ProcessTaxReturnCaseClosedRules procedure is run.  That\u0027s what happens whether the case is closed normally, by optional closure, or by deletion.\n\nPutting the changes in the unlock procedure instead of the case closed procedure makes no difference.  It has been done anyway in case one day unlocking is moved, a decision outside the scope of this change.",
        "versionObject":  {
                              "minor":  1,
                              "build":  732,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Auto Credit Transfer enhancement - multiple configurable sources - #5 - post case changes"
    },
    {
        "id":  264494,
        "version":  "3.1.720.0",
        "functionalNotes":  "Changing the moment library to luxon\n\nThis affects all parts of the web where dates are displayed and input",
        "developerNotes":  "Changing the moment library to luxon\n\nThis will require changes on client layers for any places moment is used, it will need to be replaced\n\nThis affects all parts of the web where dates are displayed and input\n\nA migration guide document is available here\n\nhttps://datatorque.sharepoint.com/sites/RMSProduct/Shared%20Documents/General/Product%20Documents/Moment%20to%20Luxon%20Conversion.docx?web=1\n\n\nTo find if you need changes, the easiest thing to is search your web project for moment(\n\nkey step\nsearch for moment.js - replace with luxon.js\nsearch for moment( and replace with helper methods in dtcore.js\n--\u003e toLuxonDate  -- used for date with out format\n--\u003e parseLuxonDateWithFormat used for dates with formats\n\n\nMost common upgrade path\nThe most common upgrade path will just be replacing moment.js with luxon.js in any checked in files in the solution\nOther migration steps would only be needed if the website has custom files with custom date handling. That shouldnt be many projects.\n\n\n\n\nIf you have any local files with that, you\u0027ll need to make changes as the moment library has been fully removed",
        "versionObject":  {
                              "minor":  1,
                              "build":  720,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Manage user access screen - dob display issue"
    },
    {
        "id":  264555,
        "version":  "3.1.742.0",
        "functionalNotes":  "Validation on when trying to enter a optional phone number, and when the online web user tries to select the same phone type. E.g. if two mobiles, or if two business phones, or if two home phones",
        "developerNotes":  "Add ValidationRule and ValidationComment to OnlineRequestQuestion record with Code = \u0027TPREG_ContactDetails_OptionalPhoneNumbers\u0027 to ensure that phone type differs from the main phone number type.\n\nNote that this OnlineRequestQuestion configuration will need to be applied to client layers as well. Client layer configuration can differ from product so I can\u0027t say exactly what each client layer configuration change would need to be but the product configuration can at least be used as an example if not copied directly.",
        "versionObject":  {
                              "minor":  1,
                              "build":  742,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Same phone type can be selected multiple times during online registration"
    },
    {
        "id":  264613,
        "version":  "3.1.740.0",
        "functionalNotes":  "Assigned the multiple roles to the user and it is able to send / create taxpayer inquiry without issue in the local branch.",
        "developerNotes":  "Increase column size for CaseManagers table\n\nUpdated the data types for Roles, Departments, and Sites in the #CaseManagers temporary table from NVARCHAR(1000) to NVARCHAR(MAX). This change allows for storing larger text entries in these columns.",
        "versionObject":  {
                              "minor":  1,
                              "build":  740,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "ENQ case not created if the role list is long"
    },
    {
        "id":  264614,
        "version":  "3.1.724.0",
        "functionalNotes":  "Fixes to the following bi processes so they run properly in the full bi refresh nightly.\n\nCase Manager Period Summary\nCase Period Summary\nReturn Period Summary\n\nThey were tied to a parent which didn\u0027t run in the overnight full bi process so didn\u0027t get run in",
        "developerNotes":  "3 bi jobs weren\u0027t running in the overnight full bi process because of bad configuration\n\nCase Manager Period Summary\nCase Period Summary\nReturn Period Summary\n\nThey were tied to a parent which didn\u0027t run in the overnight full bi process so didn\u0027t get run in",
        "versionObject":  {
                              "minor":  1,
                              "build":  724,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Overnight BI not populating CaseManagerPeriodSummary and CasePeriodSummary tables"
    },
    {
        "id":  264627,
        "version":  "3.1.731.0",
        "functionalNotes":  "PAY 001, 002, 010 to use the CurrencyCulture system constant for money formatting, falling back to the culture from vwLanguages if not configured.",
        "developerNotes":  "Updated the stored proceedures behind PAY 001, 002, 010 to use the CurrencyCulture system constant for money formatting, falling back to the culture from vwLanguages if not configured.",
        "versionObject":  {
                              "minor":  1,
                              "build":  731,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Payment report exports showing incorrect currency code"
    },
    {
        "id":  264643,
        "version":  "3.1.727.0",
        "functionalNotes":  "The date range is now displayed again underneath the Return period when you View Return on the Summary page.",
        "developerNotes":  "Fix dateOnlyMed filter in viewreturn app",
        "versionObject":  {
                              "minor":  1,
                              "build":  727,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Return filing - Online - viewing a filed return online - rounded brackets containing a dash display when they shouldn\u0027t - should display the return period date range"
    },
    {
        "id":  264683,
        "version":  "3.1.765.0",
        "functionalNotes":  "After running the script to configure the ReportText to Segmentation (see developer notes), the below areas should use \u0027Segmentation\u0027 instead of \u0027Department\u0027\n\nREG004 Report Filter title\nREG004 Report Filter indicator (inside generated report)\nREG004 Report header (in RMS)\nREG004 Report header (excel/csv)",
        "developerNotes":  "I have modified the report so that the Department column heading uses the first row of the ReportInformation Department Column (This is similar to the column TIN expression). The department is derived from the r_Department column in the ReportTextsPivot. Any client that wants to change the default of the column heading will need update the ReportText r_Department and run the spf_RebuildReportTextsPivot to update i.e. \nEXEC spt_ConfigureReportText\n    @ReportTextCode = \u0027r_Department\u0027,\n    @ReportText = \u0027Segmentation\u0027,\n    @LanguageCode = \u0027English\u0027;\n\nEXEC spf_RebuildReportTextsPivot\nGO",
        "versionObject":  {
                              "minor":  1,
                              "build":  765,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "REG 004 column heading showing incorrect text"
    },
    {
        "id":  264685,
        "version":  "3.1.750.0",
        "functionalNotes":  "When uploading files that have potential viruses, these are not brough into RMS in any way (previously brought in as 0kb files)\nThe notification when uploading potential viruses is clear and readable.",
        "developerNotes":  "Prevent storing empty files and remove faulty uploads from UI\n\nPrevent saving a resource if there was an error reading the file.\nMake sure to return server side errors to client side, but not faulty files data.\nFormat Potential Virus error and clean input file component dead files data.",
        "versionObject":  {
                              "minor":  1,
                              "build":  750,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Web - Files removed by AV still get put into RMS as 0b files - Error thrown when open "
    },
    {
        "id":  264687,
        "version":  "3.1.758.0",
        "functionalNotes":  "Issue fixes to ensure return data is inserted to TaxTypeTaxReturn",
        "developerNotes":  "small fixes in a BI proc",
        "versionObject":  {
                              "minor":  1,
                              "build":  758,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "SP spf_TaxTypeTaxReturn_selectForBI_synonyms is not inserting data"
    },
    {
        "id":  264690,
        "version":  "3.1.730.0",
        "functionalNotes":  "Issue fixes that previously Online bank transfer was not auto matched the electronic payment in RMS",
        "developerNotes":  "Iho-Only data script to fix iho configuration in BankStatementProcessTypePaymentNonCashType. No impact to client. \nProc fix in spf_BRAutomaticMatchOnlineBankTransfer to allow matching using payment reference code if any. It\u0027s a product controlled proc, hence no impact to client.",
        "versionObject":  {
                              "minor":  1,
                              "build":  730,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "BankRec Feature Review - M - Find \u0026 Select - Online Bank Transfer payment can\u0027t auto match with the existing electronic payment with same reference code"
    },
    {
        "id":  264691,
        "version":  "3.1.730.0",
        "functionalNotes":  "Issue fixes that previously Online bank transfer was not auto matched the electronic payment in RMS",
        "developerNotes":  "Iho-Only data script to fix iho configuration in BankStatementProcessTypePaymentNonCashType. No impact to client. \nProc fix in spf_BRAutomaticMatchOnlineBankTransfer to allow matching using payment reference code if any. It\u0027s a product controlled proc, hence no impact to client.",
        "versionObject":  {
                              "minor":  1,
                              "build":  730,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "BankRec Feature Review - M - Find \u0026 Select - In Systest Can\u0027t find the electronic payment for online bank transfer but Review can"
    },
    {
        "id":  264693,
        "version":  "3.1.725.0",
        "functionalNotes":  "The data format on the online request was incorrect, it was using a system constant which had the old moment date format. Date saved is now displaying correctly in My Requests with DD/MMM/YYYY NZ/UK English and MMM/DD/YYYY US English.",
        "developerNotes":  "The data format on the online request was incorrect, it was using a system constant which had the old moment date format\n\nThis has been switched to use the proper culture aware configuration, the system constant is updated but no longer used",
        "versionObject":  {
                              "minor":  1,
                              "build":  725,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "My Requests - Date saved is displayed incorrectly with extra unnecessary digits"
    },
    {
        "id":  264751,
        "version":  "3.1.734.0",
        "functionalNotes":  "This has resolved the Last Updated issue online in Inbox (All)where the sort arrow when clicked to sort by ascending or descending did not work. It does work now. The sort is also resolved in Agent Management when a there is a date field when Agent requests are added. Also resolved for in Returns list - there\u0027s sorting there by date time stamp. There\u0027s another ticket for a few other sorting by date field online.",
        "developerNotes":  "Fix the sorting issue on following page tables:\n\n1. Inbox \u003e Your Messages, Last Updated column\n2. Returns list table, Due Date and Updated Date columns \n3. Profile \u003e Agent Management list table, Last Updated column\n\nby using a new property (named ...ISO) which contains the date value in a standard format o be used for sorting, keeping the existing one just for presentation, regardless the culture.",
        "versionObject":  {
                              "minor":  1,
                              "build":  734,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Online - Inbox - Last Updated - sorting using the arrows does not sort "
    },
    {
        "id":  264758,
        "version":  "3.1.745.0",
        "functionalNotes":  "Issue fixes that in DBT and REF case, transferred credits in the case were not showing on Credit Transfer screen and History",
        "developerNotes":  "Changes made into TransferHistoryController to ensure transfer history list is loaded correctly. No impact to client.",
        "versionObject":  {
                              "minor":  1,
                              "build":  745,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Credit Transfer history is not loaded properly in the REF/DBT case "
    },
    {
        "id":  264874,
        "version":  "3.1.737.0",
        "functionalNotes":  "UI fixes to ensure the number of selected transactions is updated correctly",
        "developerNotes":  "UI controls  fixes in FindAndSelectTransactions form/model/controller files. No impact to client.",
        "versionObject":  {
                              "minor":  1,
                              "build":  737,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "BankRec Feature Review - M - Find \u0026 Select - Find \u0026 Select issue"
    },
    {
        "id":  264945,
        "version":  "3.1.737.0",
        "functionalNotes":  "Inactive Users should no longer show in the dropdown for case assignment, whether via Case Management or Bulk Case Allocation",
        "developerNotes":  "Refactored the where statement so uses the role.actions and auto allocate and does not exclude the Inactive check. CaseConfiguration was also modfied to use all parameters calling the SP.",
        "versionObject":  {
                              "minor":  1,
                              "build":  737,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Admin-\u003e Case Management -\u003e Bulk Case Allocation -\u003e New Case Manager list shows inactive users"
    },
    {
        "id":  264947,
        "version":  "3.1.753.0",
        "functionalNotes":  "Result of the reports PAY 001 and PAY 010 matched and only displaying the original value",
        "developerNotes":  "PAY 001 (Payments Received Management) gets its data from the BI DB while PAY 010 (Payment Listing) queries the transactional DB.  While some changes can be made to the SQL so that the selection logic matches, issues with the data migration or data can mean that the data sets are different. This appears most commonly with the migration of the original payment i.e. version 1 of inactive PaymentTransaction records do not appear in the  BI DB. The reason why or how the PaymentTransaction records were made inactive is not known and cannot be replicated.",
        "versionObject":  {
                              "minor":  1,
                              "build":  753,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Discrepancy between PAY 001 and PAY 010"
    },
    {
        "id":  265076,
        "version":  "3.1.762.0",
        "functionalNotes":  "When a taxpayer has Browse\u003eReturns screen open, and one of the listed returns is amended via the website (whilst the Browse\u003ereturns is open on screen), and then the amended return has the report printed from this screen, it should show the correct assessment data.",
        "developerNotes":  "The action to print this report comes from IhoUserInterface\\UserControls\\TaxReturnBrowseController.cs:PrintReturn().\nThis method passes the value for the report stored procedure parameter \u0027@TaxReturnID\u0027 from \u0027currentRow.ID\u0027.\n\nSo, if an assessment has occurred, it is possible that a new tax return record has been created under the same TaxReturnHeader record as the latest version. That would mean that the value for \u0027currentRow.ID\u0027 is invalid. Likely made inactive which is why the report is blank.\n\nThe solution was to make the report stored procedure check if there was a new active tax return under the associated tax return header record.",
        "versionObject":  {
                              "minor":  1,
                              "build":  762,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Reports - BO - Returns tab - after an assessment has been made online and clicking the print icon to view RET 005 report - Report Viewer is blank"
    },
    {
        "id":  265096,
        "version":  "3.1.752.0",
        "functionalNotes":  "Issue fixes that previously upload an embedded file in web, it started executes js when download it.",
        "developerNotes":  "Documents uploaded to the web are now stripped of javascript at the point the virus scan is done. This is done by opening the PDF as a string encoded byte stream and removing suspicious elements before restoring the document.",
        "versionObject":  {
                              "minor":  1,
                              "build":  752,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Stored XSS via Malicious PDF Upload"
    },
    {
        "id":  265122,
        "version":  "3.1.727.0",
        "functionalNotes":  null,
        "developerNotes":  null,
        "versionObject":  {
                              "minor":  1,
                              "build":  727,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Return Filing - Ihov3 and Sandbox - VAT Return design - Q5 - Any adjustments - cannot enter a value in Ihov3 and should be able to as you can in Sandbox"
    },
    {
        "id":  265129,
        "version":  "3.1.730.0",
        "functionalNotes":  "Issue fixes that the suspense payments made to taxpayer were not showing on Summary",
        "developerNotes":  "Changed Inner join on period table to left join to allow transactions without periods.",
        "versionObject":  {
                              "minor":  1,
                              "build":  730,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Adhoc suspense payment doesn\u0027t show in the Account Summary"
    },
    {
        "id":  265147,
        "version":  "3.1.748.0",
        "functionalNotes":  "No functional changes, ensure auto match is still working for the online bank transfer payment",
        "developerNotes":  "Minor change into spf_FindTINInNarratives - no impact to client who turned off BankRecon.",
        "versionObject":  {
                              "minor":  1,
                              "build":  748,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Refine spf_FindTINInNarratives proc to support overriding at client layer"
    },
    {
        "id":  265164,
        "version":  "3.1.743.0",
        "functionalNotes":  "Two Auto-Registered tax types have been configured: Ad hoc (AARNPST) and Multi Ad hoc (AMPART - previously configured but part of the acceptance criteria)\n\nAC 2\nwhen a tax type frequency is ad hoc (AARNPST)\nOnly one draft return is allowed at any given time per tax type - Passed\nThe system allows submission of one return per day - Passed\nThe submission date will be the return period - Passed\nReturn / Payment due has to be TBC - Passed\n\nwhen a tax type frequency is ad hoc multiple (AMPART)\nOnly one draft return is allowed at any given time per tax type - Passed\nOnce a return is submitted, a new return can be created - Passed\nIf no question is configured to capture the period, the system will (AMPART when No period date is entered):      \n                 Use the submission date as the return period - Passed\n                 Automatically assign a return number - Passed\nIf the return question is configured to define the period (AMPART a period date is entered):  \n                The system will use the value from the question to determine the period - Passed\n                Once submitted, amending the question value will not change the assigned period - Passed",
        "developerNotes":  "Adds new Adhoc Auto Registered with NoPeriodSelection Tax Type and update related tests.\nFixes showing alert when user tries to file another return in the same day when only one return submission is allowed.\nFixes Disclaimer position.",
        "versionObject":  {
                              "minor":  1,
                              "build":  743,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Configure Auto Registered Adhoc Tax Type with NoPeriodSelectionRequired = true"
    },
    {
        "id":  265232,
        "version":  "3.1.762.0",
        "functionalNotes":  "Filing Behaviour for a ceased tax type matches the outstanding return and TPRP points",
        "developerNotes":  "Small fix in a BI data selection proc",
        "versionObject":  {
                              "minor":  1,
                              "build":  762,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Taxpayer Risk Profiling - Filing Behaviour for a ceased tax type (BI Return Compliance)"
    },
    {
        "id":  265338,
        "version":  "3.1.744.0",
        "functionalNotes":  "issue fixes to make the adhoc return amounts on Select Period Model has the correct format",
        "developerNotes":  "Small UI fixes to show amounts in correct format",
        "versionObject":  {
                              "minor":  1,
                              "build":  744,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Multiple Ad Hoc - DP and format in Select Period model need to be updated"
    },
    {
        "id":  265344,
        "version":  "3.1.737.0",
        "functionalNotes":  "Uploaded supporting documents during a return are now displaying under the Supporting Documents with the View Return.",
        "developerNotes":  "We Just added one missing prop to the ViewReturnConfig object in the Statement.cshtml file.\nAddition of that extra prop won\u0027t cause any issues in the worst-case scenario.",
        "versionObject":  {
                              "minor":  1,
                              "build":  737,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Web - Return Statement - Supporting Documents are not showing up on the statement page under the Return tab"
    },
    {
        "id":  265361,
        "version":  "3.1.734.0",
        "functionalNotes":  "Now able to continuously file returns Online for the AMPART tax type with the configuration set for the period date being part of a return question.",
        "developerNotes":  "Fix spf_FindPeriodByTaxpayerAndAdhocDate and added tests\n\nTech Details:\nUpdated CalculateTaxReturnPeriodAsync and FindPeriodByTaxpayerAndAdhocDate methods to accept ITaxType and int taxTypeID parameters, respectively.\nUpdated GetPeriodsByTaxpayerAndTaxType test expectations.\nUpdated UpdateMultiplePeriodReturnNumberTest to stop relying on existing data and test UpdateMultiplePeriodReturnNumber functionality.\nModified spf_FindPeriodByTaxpayerAndAdhocDate to take TaxTypeID into account.\nAdded test cases in TaxPeriodRepositoryTest.cs to validate the new functionality.\nIncluded a fix in Iho-Only.sql to reactivate inactive period.\nRemove existing script in 12-AdhocMultiple.sql that violates data accuracy.",
        "versionObject":  {
                              "minor":  1,
                              "build":  734,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Multiple Ad hoc - AMPART - Unable submit a return Online through this format"
    },
    {
        "id":  265427,
        "version":  "3.1.746.0",
        "functionalNotes":  "When a draft is started Online and then completed in the BO, when logging back into the taxpayer Online there is a banner displaying: \"The following returns are no longer available for you to file online, as these have been filed on you by \u003ctax revenue authority\u003e.\" With a link to the view statement of the filed return.",
        "developerNotes":  "Fix logic to correctly display updated returns list on landing page. Exclude return drafts associated with filed returns from search. Consolidate return draft deletion logic",
        "versionObject":  {
                              "minor":  1,
                              "build":  746,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Return Filing - If a draft return is started Online, and then completed in the Back office, when logging on there should be a warning message displayed"
    },
    {
        "id":  265429,
        "version":  "3.1.754.0",
        "functionalNotes":  "Multiple issues fix on Overview and Revenue tabs, to ensure data populated correctly as per FS",
        "developerNotes":  "Adding 2 columns to BI RevenuePosting table, fixes in some MD procs related to revenue widgets and some minor label text changes",
        "versionObject":  {
                              "minor":  1,
                              "build":  754,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Management Dashboard - Multiple issues regarding Revenue Glance and accounting date"
    },
    {
        "id":  265529,
        "version":  "3.1.745.0",
        "functionalNotes":  "When there are 32 filed null returns, and then another return is filed before the 1st return, the auto credit transfer should handle this and roll forward as per configuration \n\nThis should be explored and tested with normal auto credit transfers, editing the initial return amount, increase credit/decrease credit, change to debit, etc",
        "developerNotes":  "Update credit transfer to call penalties post processing in a manner that prevents calling auto credit transfer again.\n\nAdded an integration test to validate long transfer chains work.",
        "versionObject":  {
                              "minor":  1,
                              "build":  745,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Nesting level exceeded (limit 32)."
    },
    {
        "id":  265550,
        "version":  "3.1.750.0",
        "functionalNotes":  "Issue fixed to ensure the correct signature is used based on site the taxpayer belongs to",
        "developerNotes":  "Fixing PAY 013 report proc to use report text for the matching language, tax type, department and site",
        "versionObject":  {
                              "minor":  1,
                              "build":  750,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Instalment Arrangement Confirmation Letter (PAY 013) Not Displaying Correct Signature"
    },
    {
        "id":  265572,
        "version":  "3.1.744.0",
        "functionalNotes":  "Bug fixes for credit transfer for where return has credits and debits",
        "developerNotes":  "Fixing an issue with credit transfer",
        "versionObject":  {
                              "minor":  1,
                              "build":  744,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Auto CR Transfer Enhancement - PUSH - Credit Adjustment transfer is not taking place when the return is debit"
    },
    {
        "id":  265575,
        "version":  "3.1.744.0",
        "functionalNotes":  "Fixes an issue where if you had more credits in a  period than a refund return below a refund threshold, the other credit would be transferred out, it should be blocked based on configuration",
        "developerNotes":  "Fixes an issue where if you had more credits in a  period than a refund return below a refund threshold, the other credit would be transferred out, it should be blocked based on configuration",
        "versionObject":  {
                              "minor":  1,
                              "build":  744,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Auto CR Transfer Enhancement - PUSH - Credits should not transfer to the next period when undisbursed refund exists "
    },
    {
        "id":  265688,
        "version":  "3.1.742.0",
        "functionalNotes":  "To restate the purpose of this change.  Some case types prevent a credit in a period within the scope of the case from being automatically transferred.  Once the case is closed, credits are available and should be processed without waiting for the next financial interaction.\n\nCase closure is considered too late, instead it should be at the point of unlocking the period, if the case type is one which locks the period (DBT is an example of a case type that does not).  Case Types that do not lock the period must wait until closure, there is no other indicator that the case is not a blocker for auto credit transfer.\n\nUnlocking a period within a case will trigger auto credit transfer, but only if:\n    Credit transfers are configured for the tax type / return frequency\n    At least one of the configuration flags CannotHaveAnAuditCase or CannotHaveARefundCase are set to 1\n    The locking reason for the tax return included a Case Type abbreviation for a case type that a flag of 1 refers to\n\nClosing a case will trigger auto credit transfers for all periods within the scope of the case, but only if:\n    Credit transfers are configured for the tax type / return frequency\n        The configuration flag CannotHaveADebtCase is set to 1, and\n        The case type is one that the flag of 1 refers to, i.e. DBT, or\n\n        The configuration flag CannotHaveUnpresentedRefund is set to 1, and\n        The case type is one that the flag of 1 refers to, i.e. RFD, and\n        The Refund record has no amount left to disburse",
        "developerNotes":  "The processing order of cases is not what might be expected.  Consider an Audit case.  Taxpayer Account Changes are made, submitted for approval, approved, and Save and Continue clicked.  At this point the tax return and general ledger tables are updated, penalties recalculated.  Auto credit transfer won\u0027t happen, because the case is open and the return is locked.  Once the return is unlocked, it will attempt to process auto credit transfer, but when is the tax return unlocked?\n\nThe expectation is that it\u0027s at this point, when the changes have been saved.  That turns out not to be the case.  It\u0027s not until the case is closed.  The Case is set to Closed, periods within scope are unlocked, the spf_ProcessTaxReturnCaseClosedRules procedure is run.  That\u0027s what happens whether the case is closed normally, by optional closure, or by deletion.\n\nPutting the changes in the unlock procedure instead of the case closed procedure makes no difference.  It has been done anyway in case one day unlocking is moved, a decision outside the scope of this change.\n\nNew configuration options to allow credit transfers to and from dummy returns\n\nThe current logic is for this not to happen, so be sure that cannot be a dummy return is true for source and target to preserver current functionaly.",
        "versionObject":  {
                              "minor":  1,
                              "build":  742,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Auto Credit Transfer enhancement - multiple configurable sources - #6 - eligibilty of default assessment / dummy returns"
    },
    {
        "id":  265847,
        "version":  "3.1.742.0",
        "functionalNotes":  null,
        "developerNotes":  null,
        "versionObject":  {
                              "minor":  1,
                              "build":  742,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Invalid JSON configuration - Auto Credit Transfer"
    },
    {
        "id":  265854,
        "version":  "3.1.759.0",
        "functionalNotes":  "Able to configure Supporting (Additional) Document sizes for different returns with the size appearing correctly in \"What files can I upload?\" and the error message that appears when the files is too large.",
        "developerNotes":  "Implemented the logic to allow setting the max file size per Tax Return Design.\n\ne.g. to set Individual - VAT to 20Mb run:\n\nEXEC spt_ConfigureDocumentation\n    @DocumentationTypeCode       = \u0027TaxReturn\u0027,\n    @DocumentTypeCode            = \u0027SupportingDocument\u0027,\n    @DocumentTypeDescription     = \u0027Supporting Document\u0027,\n    @IsRequired                  = 0,\n    @MaxFileSize                 = 20480,\n    @TaxReturnDesignTypeCode     = \u0027STD\u0027,\n    @TaxTypeCode                 = \u0027VAT\u0027,\n    @TaxReturnDesignCommenceDate = \u002720140101\u0027;",
        "versionObject":  {
                              "minor":  1,
                              "build":  759,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "[Development] Allow different max file size per tax return"
    },
    {
        "id":  265877,
        "version":  "3.1.761.0",
        "functionalNotes":  "Campaigns works without issue. Notifications and sent and received without error.",
        "developerNotes":  "Improving some BI procs to help with debugging and also providing _client procs for them",
        "versionObject":  {
                              "minor":  1,
                              "build":  761,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Bulk Data Update Step - Compliance Data - PR Comments"
    },
    {
        "id":  265924,
        "version":  "3.1.744.0",
        "functionalNotes":  "The following functionality are impacted, they are\n1 Large Xml Upload \n2. Bulk XML Upload\n\nPAYE taxtype is more appropriate for testing these functionality",
        "developerNotes":  "Trim TaxpayerNumber in the following stored procedure \"spf_BulkValidateListOfTINs\" which will not impact any functionality",
        "versionObject":  {
                              "minor":  1,
                              "build":  744,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "PAYE - Large or Bulk XML upload Issue"
    },
    {
        "id":  265925,
        "version":  "3.1.736.0",
        "functionalNotes":  "Field is only accepting max 100 chars and was kept in the front and nothing more than 100 chars goes to the DB and letter is up to 100 chars too",
        "developerNotes":  "Add maxlength attribute to input tags. Add [StringLength] attribute to model contract",
        "versionObject":  {
                              "minor":  1,
                              "build":  736,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Unrestricted Input Length in  RequestTaxpayerAccess/Designation Field  Potential Buffer  Overflow and Application Instability"
    },
    {
        "id":  266027,
        "version":  "3.1.739.0",
        "functionalNotes":  "When Multiple Ad hoc return is setup for No Period Selection at the start of the return (instead as a return question), the period line no longer appears underneath the tax type of the File a Return page. When one selects a date for another return type (for example, AMRRT) and then switches it to AMPART (which is setup with No Period selection at the start) and the Period field no longer appears from the previous tax type.",
        "developerNotes":  "Hide calendar control for no-period selection tax types\n\nThis hides the calendar control when a tax type that does not require period selection is selected.",
        "versionObject":  {
                              "minor":  1,
                              "build":  739,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Multiple Ad hoc - Period field appearing on File a Return when it should not for Multiple Ad hoc return with no period selection"
    },
    {
        "id":  266028,
        "version":  "3.1.742.0",
        "functionalNotes":  "Floor is still working as expected like what was the system was defaulted to. ROUND is working too rounding to the right decimal or whole number depending on the next number and or currency factor. Ceiling is working too.",
        "developerNotes":  "Add rounding technique constant for late filing fee\n\nIntroduce a new system constant ProcessTaxReturnLateFilingFeeRoundingTechnique in SystemConstants.xml with a default value of \"FLOOR\". Update spf_ProcessTaxReturnLateFilingFee.sql to use dbo.fGetRoundedCurrency for calculating late filing fees. Add a corresponding entry in Data.sql to set the constant in the database.",
        "versionObject":  {
                              "minor":  1,
                              "build":  742,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Implement fGetRoundedCurrency in spf_ProcessTaxReturnLateFilingFee"
    },
    {
        "id":  266032,
        "version":  "3.1.767.0",
        "functionalNotes":  "Add feature toggle enabled / disabled for \u0027ToggleBrowseChildTaxTypes\u0027. This is enabled in Iho and disabled in client layers by default",
        "developerNotes":  "Add feature record for \u0027ToggleBrowseChildTaxTypes\u0027. This is enabled in Iho and disabled in client layers by default",
        "versionObject":  {
                              "minor":  1,
                              "build":  767,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Browse Tax Type Display of Child Tax Types: Add as Feature"
    },
    {
        "id":  266056,
        "version":  "3.1.767.0",
        "functionalNotes":  "The label and checkbox for \"Show child tax types\" displays on the Browse \u003e Tax Types tab",
        "developerNotes":  "Add \"Show child tax types\" checkbox to BrowseModel / BrowseController. Add resource for \"Show child tax types\" text",
        "versionObject":  {
                              "minor":  1,
                              "build":  767,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Browse Tax Type Display of Child Tax Types: Add checkbox to the Browse -\u003e Tax Types userinterface"
    },
    {
        "id":  266066,
        "version":  "3.1.767.0",
        "functionalNotes":  "When checkbox is checked the child taxtypes will display in the Browse Tax Types window.",
        "developerNotes":  "Toggle display of child tax types on browse taxpayer window when the checkbox is checked",
        "versionObject":  {
                              "minor":  1,
                              "build":  767,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Browse Tax Type Display of Child Tax Types: Add checkbox display logic"
    },
    {
        "id":  266068,
        "version":  "3.1.767.0",
        "functionalNotes":  "Testing logic around when the Show child tax types feature is enabled and when the feature is disabled. When the feature is turned off, the full list of taxtypes display (including child taxtypes)",
        "developerNotes":  "Update display logic of \"Show child tax types\" checkbox to display when feature \u0027ToggleBrowseChildTaxTypes\u0027 is enabled and child tax types exist",
        "versionObject":  {
                              "minor":  1,
                              "build":  767,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Browse Tax Type Display of Child Tax Types: Configure the initial display of the checkbox"
    },
    {
        "id":  266069,
        "version":  "3.1.767.0",
        "functionalNotes":  "N/A",
        "developerNotes":  "Update existing feature integration tests to incorporate new \u0027ToggleBrowseChildTaxTypes\u0027 feature",
        "versionObject":  {
                              "minor":  1,
                              "build":  767,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Browse Tax Type Display of Child Tax Types: Add relevant tests"
    },
    {
        "id":  266103,
        "version":  "3.1.777.0",
        "functionalNotes":  "no functional changes",
        "developerNotes":  "Some test framework enhancements, purely technical change",
        "versionObject":  {
                              "minor":  1,
                              "build":  777,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "BaseTestFixture AssertPropertyValues method doesn\u0027t handle nullable dates"
    },
    {
        "id":  266104,
        "version":  "3.1.756.0",
        "functionalNotes":  "No functional changes",
        "developerNotes":  "Removed logics from all matchings procs for Fee and Sweep. Minor fixes in to adjustment reason control enabled/view issue. No impact to client.",
        "versionObject":  {
                              "minor":  1,
                              "build":  756,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Hard coded ID in spf_BRManualMatchingCandidatesFee"
    },
    {
        "id":  266117,
        "version":  "3.1.748.0",
        "functionalNotes":  "When adding additional content into the notifications, and the user has entered the information on more than one row i.e. used the enter key or shift + enter on their keyboard, the additional content will be listed like as it was entered.",
        "developerNotes":  "Fix new lines when inserting content in email\nAlso update faulty ReturnAssessmentRequestFurtherInformationBody to stop showing html tags",
        "versionObject":  {
                              "minor":  1,
                              "build":  748,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "IhoWeb uses invalid \u003c/br\u003e tags when replacing content with line-breaks."
    },
    {
        "id":  266120,
        "version":  "3.1.752.0",
        "functionalNotes":  "Translations are now displayed for the listed items",
        "developerNotes":  "Fixing/applying resource texts for many labels on some DBT case screens",
        "versionObject":  {
                              "minor":  1,
                              "build":  752,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Selected Language Not Applied to Labels in Instalment Arrangement Flow"
    },
    {
        "id":  266143,
        "version":  "3.1.746.0",
        "functionalNotes":  "Submitting online requests (e.g. online TPREG) still works.",
        "developerNotes":  "Clear source properties from the online request submission payload on submit then refresh these again on the server. This significantly reduces the submission payload size",
        "versionObject":  {
                              "minor":  1,
                              "build":  746,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "3 copies of the country list being passed to the server"
    },
    {
        "id":  266335,
        "version":  "3.1.743.0",
        "functionalNotes":  "Issue fixes to ensure data won\u0027t duplicate",
        "developerNotes":  "Fixes in 3 procs, 2 of them related to BI population and remaining a report proc",
        "versionObject":  {
                              "minor":  1,
                              "build":  743,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Record duplicates in REV001 Report"
    },
    {
        "id":  266387,
        "version":  "3.1.756.0",
        "functionalNotes":  "Validation in place when user tries to upload a zero sized file",
        "developerNotes":  "Implemented zero size file validation.",
        "versionObject":  {
                              "minor":  1,
                              "build":  756,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "ENQ Case Config - Ihov3 \u0026 Sandbox - FP130 - Attaching a zero size text file throws and error instead of a validation message"
    },
    {
        "id":  266388,
        "version":  "3.1.753.0",
        "functionalNotes":  "Can no longer upload invalid file types into Taxpayer Enquiry",
        "developerNotes":  "Implemented a validation of the file extension after selection.\n\nClients must have set the FileAttachmentTypesFilter system constant in the right format, e.g.:\n\nPDF|*.pdf|Compressed files|*.zip;*.rar|Excel Spreadsheet|*.xls;*.xlsx|Word Document|*.doc;*.docx|Images|*.gif;*.jpg;*.jpeg;*.png|Text Document|*.txt|XML|*.xml\n\nHandy query: SELECT ConstantValue FROM SystemConstant WHERE [Name] = \u0027FileAttachmentTypesFilter\u0027",
        "versionObject":  {
                              "minor":  1,
                              "build":  753,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "ENQ Case Config - Ihov3 \u0026 Sandbox - FP130 - can attach an invalid file type "
    },
    {
        "id":  266421,
        "version":  "3.1.762.0",
        "functionalNotes":  "vwAccountAdjustmentReasons no longer shows inactive AccountTypes",
        "developerNotes":  "minor fix in a DB view",
        "versionObject":  {
                              "minor":  1,
                              "build":  762,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "SQL view \"vwAccountAdjustmentReasons\" missing filter on Inactive flag for table AccountType"
    },
    {
        "id":  266423,
        "version":  "3.1.750.0",
        "functionalNotes":  "Sanitised date value so that we have clean date string without any unnecessary chars included.",
        "developerNotes":  "Updated datepicker vue component in the online frontend framework to clean date value if it is wrapped inside quote pair so that it can be parse by luxon.js date functions.\nSide effects: No side effects if date value has a valid date string.",
        "versionObject":  {
                              "minor":  1,
                              "build":  750,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "[Web] - Returns - Date type of question with proc call in the defaulter not pre-populating the value"
    },
    {
        "id":  266573,
        "version":  "3.1.754.0",
        "functionalNotes":  "When a Main tax type is selected (and the dependent tax type is unavailable to be assigned through tax agent or taxpayer registration), the dependent tax types of the that Main tax type are then available along with the Main tax type to View Tax Accounts, Make Payments, to File and View Returns. The example of this in Iho V3 Systest is: \nPAYE (Main) \u003e PAYER (Dependent)\nIncome Tax (Main) \u003e Provisional Tax (Dependent) and Provisional Instalment Tax (Dependent)",
        "developerNotes":  "Please note: projects may need to write a migration script for existing tax agent requests for dependent tax types as no dependent tax types will be accepting a separate agent requests. They will be assigned when the main type is assigned to the tax agent.\n\nRefactor tax type handling for dependent tax types Online\n\nEnhanced test cases in TaxpayerAgentAssignmentRepositoryTest.cs to specify checks for children and dependents.\nModified expected roles and tax types in WebUserRepositoryTest.cs to exclude dependent types.\nAdjusted FindWebEnabledTaxTypes in TaxTypeRepository.cs to filter out dependent tax types.\nAdded SQL logic in fGetTaxTypeIDsOfTaxTypeLevelAssociatedTaxAgent.sql to handle dependent tax types.\nUpdated spf_TaxpayerAgentAssignment_SelectTaxpayerActiveTaxTypes.sql to exclude dependent tax types.\nUpdated logic in spf_WebUserTaxType_assign.sql to assign dependent tax types to users.\nExcluded dependent tax types in spf_WebUserTaxType_selectByGroupingGuid.sql and spf_WebUserTaxType_selectByWebUser.sql.",
        "versionObject":  {
                              "minor":  1,
                              "build":  754,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Tax Agent Request / Web User Mangement for Dependent Tax Types"
    },
    {
        "id":  266609,
        "version":  "3.1.742.0",
        "functionalNotes":  "Not testing required says Dev.\n\n\"Fix report extraction logic and improve data handling. No application changes. No tests required.\"",
        "developerNotes":  "Fix report extraction logic and improve data handling. No application changes. No tests required.",
        "versionObject":  {
                              "minor":  1,
                              "build":  742,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Fix Report script extractor"
    },
    {
        "id":  266615,
        "version":  "3.1.746.0",
        "functionalNotes":  "BI Views are auto re-generated as part of each full bi rebuild , these views are auto generated and are used in population  of return data",
        "developerNotes":  "The procedure to re-generate had incorrect permissions and wasn\u0027t running properly.",
        "versionObject":  {
                              "minor":  1,
                              "build":  746,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Processing Service permission issue - BI update process is calling this stored procedure spt_ConfigureBIViews - "
    },
    {
        "id":  266678,
        "version":  "3.1.746.0",
        "functionalNotes":  "Return generated no interest after updating taxpayeable to NULL",
        "developerNotes":  "Fixing sys calc proc to not apply penalties for dummy returns having core debt.",
        "versionObject":  {
                              "minor":  1,
                              "build":  746,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "CY-1218 - Scenario 5 - Period had P\u0026I calculated when previously it did not"
    },
    {
        "id":  266696,
        "version":  "3.1.772.0",
        "functionalNotes":  "Additional functionality in the penalty calculation to handle migrated data that creates situations impossible to duplicate from within RMS.\n\nEnforcement of the fact that a credit transfer out, or a paid out refund (or cancellation of a payment) increases the core tax.\nExplanation: credit transfers out and refunds are ultimately sourced from credit returns.  The negative core tax balance decreases in magnitude.  i.e. the core tax balance increases.",
        "developerNotes":  "Two new system constants.  DMTransactionMatchingEnabled (defaults to false) and DMTransactionMatchingLimitToSameType (defaults to true).\nThis is to handle the situation where migrated transactions in a period cancel each other (same effective date, same amount but different sign), but are not excluded because they have no value in ReverseID.  This causes inconsistencies in the penalty calculation.\n\nWhen set to true, DMTransactionMatchingEnabled looks for these matched migrated transactions and ignores them.  Inconsistency gone.\n\nIn Cyprus we have examples of a \"(TT51-PAY-A) Transfer from other period)\" credit in the suspense account reversed by a \"(TT50-PAY) Cancellation of Payment\" debit in the cash account.\nWhen DMTransactionMatchingLimitToSameType is left as true, RMS would not match these transactions.  Inconsistency remains.\nWhen DMTransactionMatchingLimitToSameType is set to false, RMS would match these transactions.  Inconsistency gone.\n\nMultiple pre-payments or pre-credit transfers (the latter of which happens regularly when auto credit transfer is configured) were not broken down correctly, the full breakdown was applied to the latest occurrence.",
        "versionObject":  {
                              "minor":  1,
                              "build":  772,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "CY-1223 - Scenario 2 - Credits without ReverseIDs not being properly handled in debt interest calculations."
    },
    {
        "id":  266717,
        "version":  "3.1.748.0",
        "functionalNotes":  "TPREG works as expected",
        "developerNotes":  "Load online request sources dictionary by default to reduce payload (see OnlineRequestWizardController.GetOnlineRequestWizard()). Update client side logic to handle mapping dictionary to online request question sources (see newly introduced populateQuestionSourcesFromDictionary() function in request/mixin.ts)",
        "versionObject":  {
                              "minor":  1,
                              "build":  748,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Retrieving online request wizard shouldn\u0027t duplicate lookup data sources in payload"
    },
    {
        "id":  266747,
        "version":  "3.1.751.0",
        "functionalNotes":  "Issue fixes to ensure TINOrName  is still working in the DisplayDetailQuestionEnhanced (Vertical Form) module",
        "developerNotes":  "minor enhancement to the new detail question UI",
        "versionObject":  {
                              "minor":  1,
                              "build":  751,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "DisplayDetailQuestionEnhanced (Vertical Form) TINOrName Caption Not Configurable"
    },
    {
        "id":  266749,
        "version":  "3.1.757.0",
        "functionalNotes":  "Hidden questions are now also included in the caalculations.",
        "developerNotes":  "Small change related to visibility logic for detail questions on the new Detail UI",
        "versionObject":  {
                              "minor":  1,
                              "build":  757,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "The Enhanced Grid in the Back Office Tax Returns to do the calculations for the hidden Detail Questions"
    },
    {
        "id":  266779,
        "version":  "3.1.751.0",
        "functionalNotes":  "Issue fixes to ensure data is populated correctly in PAY003 while bank recon is off",
        "developerNotes":  "Minor fix in spr_CashierReconciliation to ensure left join to Bank related tables due to cashier recon records could have empty bank details. No impact to client.",
        "versionObject":  {
                              "minor":  1,
                              "build":  751,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "spr_CashierReconciliation is not returning data"
    },
    {
        "id":  266780,
        "version":  "3.1.759.0",
        "functionalNotes":  "Deleted cases can now be restored without issue.",
        "developerNotes":  "Minor refactor in the logic for restoring a case",
        "versionObject":  {
                              "minor":  1,
                              "build":  759,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Incorrect message displayed when restoring case"
    },
    {
        "id":  266782,
        "version":  "3.1.758.0",
        "functionalNotes":  "Issue fixes to ensure on Garnishee Request Page, all fields are translated correctly",
        "developerNotes":  "Added new resource key as below. Client team might want to add its translation into their layer. \n--Label_GarnisheeRecipientDetails \n--Label_GarnisheeInstructions \n--Label_ForTheAttentionOf \n--Label_SpecificGarnisheeInstructions \n--Label_GarnisheePaymentReferenceNumber \n--Label_AmountRequested",
        "versionObject":  {
                              "minor":  1,
                              "build":  758,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Hardcoded Labels on Garnishee Request Page Do Not Reflect Selected Language"
    },
    {
        "id":  266820,
        "version":  "3.1.746.0",
        "functionalNotes":  "When using the Request management Framework Online (Online TPREG, Extension, Objection and Register a New Taxpayer) and there\u0027s a draft and the language is changed from English NZ to Greek the spinning wheel of death does not happen, the Application Overview page reloads in the language the web user has chosen.",
        "developerNotes":  "Fix issues with switching languages during online request caused by new source dictionary approach and detail question default value type changes",
        "versionObject":  {
                              "minor":  1,
                              "build":  746,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Switching languages during online request no longer working"
    },
    {
        "id":  266831,
        "version":  "3.1.742.0",
        "functionalNotes":  null,
        "developerNotes":  null,
        "versionObject":  {
                              "minor":  1,
                              "build":  742,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Group Registration - The system displays Position is a required field when there is a default value in the field. "
    },
    {
        "id":  266854,
        "version":  "3.1.746.0",
        "functionalNotes":  "Issue fixes that in DBT and REF case, transferred credits in the case were not showing on Credit Transfer screen and History",
        "developerNotes":  "Changes made into TransferHistoryController to ensure transfer history list is loaded correctly. No impact to client.",
        "versionObject":  {
                              "minor":  1,
                              "build":  746,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "[REF]- UI issue- Credit transfer was done but it doesn\u0027t show in previous task and history"
    },
    {
        "id":  266897,
        "version":  "3.1.751.0",
        "functionalNotes":  "Bulk Case Allocation Case Manager count and the number of cases appearing in the case list are now aligned after switching to a new manager and then switching back to the old manager.",
        "developerNotes":  "Minor fix in CaseConfigurationRepo method FindCurrentCasesForManager to include the filter whether or not to load the list from cache. No impact to client.",
        "versionObject":  {
                              "minor":  1,
                              "build":  751,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Admin - Case Management - Bulk Case Allocation and Reversal"
    },
    {
        "id":  266913,
        "version":  "3.1.745.0",
        "functionalNotes":  "No functional change - update to helper script only",
        "developerNotes":  "Update to helper script only",
        "versionObject":  {
                              "minor":  1,
                              "build":  745,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Update json extraction script for emails"
    },
    {
        "id":  267082,
        "version":  "3.1.748.0",
        "functionalNotes":  "Once a mandatory return is marked Not Required, it is unable to be filed Online and will display Return Not Required in the tax Accounts and View Statement and the period will not be available under File a Return.\n\nDummy Returns are already set Not Required by default but are able to be filed despite this.",
        "developerNotes":  "Exclude tax returns marked as not required from online file a return page",
        "versionObject":  {
                              "minor":  1,
                              "build":  748,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Mandatory Returns marked as Not Required"
    },
    {
        "id":  267100,
        "version":  "3.1.748.0",
        "functionalNotes":  "No functional change, minor change to improve integration tests",
        "developerNotes":  "Minor change to set the taxpayer risk profile parameters to clean after loading - this prevents resaving of unchanged parameters and improves tests speed",
        "versionObject":  {
                              "minor":  1,
                              "build":  748,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Integration Tests - Performance - Risk Profiling"
    },
    {
        "id":  267243,
        "version":  "3.1.751.0",
        "functionalNotes":  "Updating the Change of Taxpayer name in the body of the notification once a change case has been approved. The Name of the taxpayer now = the ResolvedName in the database",
        "developerNotes":  "Changed the letter to use resolved taxpayer name in the body, same as the resolved taxpayer name in the letter header.",
        "versionObject":  {
                              "minor":  1,
                              "build":  751,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Old taxpayer name still appears on the Change of Taxpayer Registration letter after CHG case approval"
    },
    {
        "id":  267323,
        "version":  "3.1.766.0",
        "functionalNotes":  "Using the Risk Rating field in Ihov3_SysTest, a user can no longer move on from the TAC task without entering or having not saved a value. This is due to CaseTaskAnswers being a thing and no longer using Answers.\n\nThis has gone into Ihov3_SysTest 3.753.0 and is not completely resolved as the Dev cannot reproduce the \u0027NULL\u0027 issue, however the Tester can reproduce it in the same version. This is a low external impact and we the Platform Team has assessed the situation and see that this issue is not any worse and has not introduced any other issues that we can see.",
        "developerNotes":  "The Case object now no longer saves all objects in Answers, but instead saves the CaseTaskAnswers, a subset of Answers that have a CaseTaskID. This passes all tests in iho, but please verify cases save and load as expected when upgrading through this version of Iho.",
        "versionObject":  {
                              "minor":  1,
                              "build":  766,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Case task able to be saved without a required case task question"
    },
    {
        "id":  267328,
        "version":  "3.1.752.0",
        "functionalNotes":  "Once a taxpayer has been ceased and the feature that prevents ceased ad hoc filing is turned off, the ceased taxpayer is unable to file an adhoc return (for NoPeriodSelection) from the date after their cessation.",
        "developerNotes":  "Online: Return an accurate error message when trying to file a NoPeriodSelection Adhoc Tax type by a ceased taxpayer or for a ceased tax type\n\nadded ValidateAdhocTaxTypeNotCeased for checking ceased tax types.\nEnhanced ApiRegistrationRepository.cs with new dependencies and added ValidateNoPeriodSelectionAdhocTaxTypeNotCeasedAsync method for registration validation.\nUpdated IApiRegistrationRepository interface to include the new validation method.\nAdded a localized string in ResourceHelper.cs for cancelled tax types.\nModified GetReturns method in ReturnAddController.cs to return an object with results and error messages, including logic for ceased tax types.\nUpdated ReturnAdd.js to handle the new API response structure.\nAdded unit tests in ApiRegistrationRepositoryUnitTest.cs to validate new functionality and ensure correct messaging based on registration status.",
        "versionObject":  {
                              "minor":  1,
                              "build":  752,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "[Multiple Ad hoc] - When Feature Flag is off, the NoPeriodSelection tax types have inappropriate banners for the situation"
    },
    {
        "id":  267340,
        "version":  "3.1.751.0",
        "functionalNotes":  "RMS Web is now only displaying messages that are configured",
        "developerNotes":  "Update the following SPs to only show allowed correspondence types online:\nspf_OnlineMessage_selectUnread.sql\nspf_OnlineConversation_select.sql\nspf_OnlineMessage_countUnread",
        "versionObject":  {
                              "minor":  1,
                              "build":  751,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "RMS Web is displaying messages not configured if sent from iho Browse"
    },
    {
        "id":  267389,
        "version":  "3.1.752.0",
        "functionalNotes":  "Issue fixes to ensure the selected periods are still showing after refund file is generated in RFD case",
        "developerNotes":  "Minor fix in CaseTaskSelectRefundsModel to ensure SelectedRefundPeriod list is not removed when refund has paid out/case is closed. No impact to client.",
        "versionObject":  {
                              "minor":  1,
                              "build":  752,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "[RFD]- Selected periods don\u0027t show once generated the refund file"
    },
    {
        "id":  267412,
        "version":  "3.1.748.0",
        "functionalNotes":  "No changes to any RMS application. Just changes on scripts to generate Json config files.",
        "developerNotes":  "No changes to any RMS application. Just changes on scripts to generate Json config files.",
        "versionObject":  {
                              "minor":  1,
                              "build":  748,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Fix Json extractor"
    },
    {
        "id":  267492,
        "version":  "3.1.773.0",
        "functionalNotes":  "Allows the config tool to setup RMS correctly when it comes to this table \"CreditTransferChainOrigin\", there was a typo inadvertently in the name. It has now been corrected.",
        "developerNotes":  "minor typo fix in the name of a config data definition",
        "versionObject":  {
                              "minor":  1,
                              "build":  773,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Configuration Tool - New \"CreditTransferChainOrigin\" data definition has incorrect interface name"
    },
    {
        "id":  267495,
        "version":  "3.1.759.0",
        "functionalNotes":  "n/a",
        "developerNotes":  "n/a",
        "versionObject":  {
                              "minor":  1,
                              "build":  759,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Troubleshooting TC pipeline issues"
    },
    {
        "id":  267538,
        "version":  "3.1.757.0",
        "functionalNotes":  "There are now two separate tokens being used for AmendTaxTypeNameReturnText and TaxTypeNameReturnText in the Return Wizard to allow Cyprus to use the correct translation for these separately.",
        "developerNotes":  "Breaking Change:\n\nAmendTaxTypeNameReturnText translation token has been added and needs to be translated for Cyprus. Failure to do so will cause amending returns to present untranslated text.\nNote, the value of TaxTypeNameReturnText has changed, and needs to be retranslated for Cyprus.\n\nThis new translation token will replace TaxTypeNameReturnText entirely, allowing for the translation separation requested.",
        "versionObject":  {
                              "minor":  1,
                              "build":  757,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Online Translations - Return Nominative and Genitive Case."
    },
    {
        "id":  267811,
        "version":  "3.1.752.0",
        "functionalNotes":  "Unsafe files are not being uploaded regardless of whether is being uploaded individually or with other safe and unsafe files",
        "developerNotes":  "Remove thumbnail on failed upload",
        "versionObject":  {
                              "minor":  1,
                              "build":  752,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Web - Unsafe files aren\u0027t removed from multi-upload UI when only unsafe files used"
    },
    {
        "id":  267821,
        "version":  "3.1.764.0",
        "functionalNotes":  "Bug fix for credit transfer push - it was moving on one period too many",
        "developerNotes":  "The check for the push should have been done after the initial push and done on the source not the target dates. The proc was updated to ensure the check was done properly.",
        "versionObject":  {
                              "minor":  1,
                              "build":  764,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Automatic Credit Roll Forward - Credits are automatically transferred in the future"
    },
    {
        "id":  267892,
        "version":  "3.1.758.0",
        "functionalNotes":  "TestComplete Failed Runs Investigation and re-runs S26",
        "developerNotes":  "TestComplete Failed Runs Investigation and re-runs S26",
        "versionObject":  {
                              "minor":  1,
                              "build":  758,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "TestComplete Failed Runs Investigation and re-runs S27"
    },
    {
        "id":  267964,
        "version":  "3.1.753.0",
        "functionalNotes":  "Uploaded supporting documents during a return are now displaying under the Supporting Documents with the View Return.",
        "developerNotes":  "The DatePickerShortDateFormatLuxon format being used for the display was not available and was causing an error so the documents would not display.  This has now ben included in the ReturnView Model",
        "versionObject":  {
                              "minor":  1,
                              "build":  753,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Web - Support Documents not showing in Return after filing"
    },
    {
        "id":  267975,
        "version":  "3.1.757.0",
        "functionalNotes":  "When there\u0027s a tax holiday, the calculations are completed successfully in the Debt Instalment Arrangement",
        "developerNotes":  "Modified processing of the taxpayers tax type Tax Holiday in the penalty calculation stored procedures.",
        "versionObject":  {
                              "minor":  1,
                              "build":  757,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Debt Instalment calculation invalid with Tax Holiday"
    },
    {
        "id":  267990,
        "version":  "3.1.758.0",
        "functionalNotes":  "Issue fixes that the penalties less than write off amounts also need to be waved in SOA",
        "developerNotes":  "Fix penalty procs to include write off logic for report breakdown - spf_ProcessPenalty\nFix rev004 proc: - spr_StatementOfAccount_Transactions\n- to remove unwanted utc date conversion for report date range filters. \n- to ensure opening and closing balance is using running total value. \nClient might want to grab these fixes if all the procs listed above is overridden at their layer.",
        "versionObject":  {
                              "minor":  1,
                              "build":  758,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "REV 004 Statement of Account - Auto writeoffs logic is not supported in the report"
    },
    {
        "id":  268006,
        "version":  "3.1.758.0",
        "functionalNotes":  "Issue fixes to ensure the order of transactions are correct on SOA report",
        "developerNotes":  "Minor rdl fix to ensure the tablix group properties is sorting using the correct field. Would advise to apply this changes into overridden rdl at client layer, otherwise no impact.",
        "versionObject":  {
                              "minor":  1,
                              "build":  758,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "REV 004 Statement of Account - Order of transaction in the Account Transaction grid"
    },
    {
        "id":  268010,
        "version":  "3.1.758.0",
        "functionalNotes":  "Issue fixes to ensure Opening Balance is correctly showing",
        "developerNotes":  "No code changes made into this ticket.",
        "versionObject":  {
                              "minor":  1,
                              "build":  758,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "REV 004 Statement of Account - Opening / Closing Balance when there is credit return"
    },
    {
        "id":  268066,
        "version":  "3.1.766.0",
        "functionalNotes":  "The Registration Confirmation notification is to spec with no extra padding",
        "developerNotes":  "Modified the HTML so that the breaks are removed. The reserialising of the HTML in the Web has inconsistencies.",
        "versionObject":  {
                              "minor":  1,
                              "build":  766,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Confirmation of Registration RMS Web letter for Auto TP Reg is displayed with lots of spaces"
    },
    {
        "id":  268331,
        "version":  "3.1.758.0",
        "functionalNotes":  "When logged into the Back office RMS in Pseudo (or a language that is longer than English), at the Negotiate Instalment Arrangements, there is no overlapping of Labels and their respective fields or underlapping for that matter. The Dev moved the fields slightly to the right to accommodate the long label \u0027Arrangement Start Date:\u0027 plus a couple of others in the Instalment Schedule Section.",
        "developerNotes":  "Modified interface so that the labels have more length and aligned the textboxes where possible",
        "versionObject":  {
                              "minor":  1,
                              "build":  758,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "DBT Case: Labels with long names overlap with field next to it i.e., Labels in Pseudo (long ones)"
    },
    {
        "id":  268553,
        "version":  "3.1.762.0",
        "functionalNotes":  "n/a - internal ticket to Platform",
        "developerNotes":  "n/a - internal ticket to Platform",
        "versionObject":  {
                              "minor":  1,
                              "build":  762,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Implement PR template for Engineering"
    },
    {
        "id":  268580,
        "version":  "3.1.758.0",
        "functionalNotes":  "Issue fixes to ensure the written off is working correctly in REV003",
        "developerNotes":  "No code changes made into this ticket.",
        "versionObject":  {
                              "minor":  1,
                              "build":  758,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "REV 003 Penalty Breakdown - Auto writeoffs logic is not supported in the report"
    },
    {
        "id":  268653,
        "version":  "3.1.771.0",
        "functionalNotes":  "The modal or pop-out for Delete Draft? has been updated to the latest design. The confirmation and cancel buttons have also been updated",
        "developerNotes":  "Update tax return delete draft modal\n\nRename confirmation button to match other draft modals\nRename cancel button to match other draft modals",
        "versionObject":  {
                              "minor":  1,
                              "build":  771,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Multi Ad-hoc returns - UI - Online - Inconsistent use of Delete messaging / button text "
    },
    {
        "id":  268655,
        "version":  "3.1.756.0",
        "functionalNotes":  "Fixes issue with credit transfers relating to account adjustments against the account type of bank",
        "developerNotes":  "When you make more than one account adjustment to a period with the account type of bank and no other entries exist on the period bar those adjustments only the first one will be pushed forward.",
        "versionObject":  {
                              "minor":  1,
                              "build":  756,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Automatic Credit Roll Forward - Some credits are not automatically transferred in all scenarios"
    },
    {
        "id":  268685,
        "version":  "3.1.761.0",
        "functionalNotes":  "If there are existing returns 1, 2, and 3, and return 2 is deleted, the sequence numbers for returns 1 and 3 will remain unchanged.\nIf return 3 is deleted, the next created return will use the new sequence number 4, as sequence number 3 has already been used.",
        "developerNotes":  "Change the period searcher to account for inactive returns when searching for filed returns when determining the return number of the next unfiled multi-adhoc return.\n\nThis is a change from vwTaxReturn to table joins on TaxReturnHeader and TaxReturn.",
        "versionObject":  {
                              "minor":  1,
                              "build":  761,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Multi Ad-hoc returns - Back Office - Deleted return is replaced with the same number"
    },
    {
        "id":  268700,
        "version":  "3.1.754.0",
        "functionalNotes":  "Can now toggle the Online Bank Account Profile feature off and on again",
        "developerNotes":  "Add check that \"OnlineBankAccountProfile\" feature is enabled when determining whether the user can view online bank accounts",
        "versionObject":  {
                              "minor":  1,
                              "build":  754,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Online Profile - Bank Account - when the bank account feature is disabled, the Bank Account tab still displays online"
    },
    {
        "id":  268722,
        "version":  "3.1.755.0",
        "functionalNotes":  "n/a as relates to web ui tests",
        "developerNotes":  "n/a as relates to web ui tests",
        "versionObject":  {
                              "minor":  1,
                              "build":  755,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "[FTProductBuild] Fix failed web user access ui tests"
    },
    {
        "id":  268741,
        "version":  "3.1.764.0",
        "functionalNotes":  "order of Proposed Account Summary going to the correct period when it applies to Multi Adhoc tax types",
        "developerNotes":  "Include join to PeriodID within spf_AddPenaltyToGeneralLedger in order to set proposed transaction period information correctly when TransID is used over multiple periods",
        "versionObject":  {
                              "minor":  1,
                              "build":  764,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Multi Ad-hoc returns - Back Office - Account adjustment - Proposed Account Summary not applying penalty to correct period"
    },
    {
        "id":  268743,
        "version":  "3.1.763.0",
        "functionalNotes":  "Issue fixes to show the only select # of period",
        "developerNotes":  "Small UI level fixes",
        "versionObject":  {
                              "minor":  1,
                              "build":  763,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Multi Ad-hoc returns - Back Office - Account adjustment - Showing all transactions not pertaining to entered \u0027Period\u0027"
    },
    {
        "id":  268747,
        "version":  "3.1.763.0",
        "functionalNotes":  "Browse\u003eCorrespondence should now accurately filter and display Adhoc Tax Type specific correspondence via Online Messages, when TaxTypes on the left are selected to ALL and also the specific tax type.",
        "developerNotes":  "Include results for linked adhoc periods in taxpayer correspondence tab. Add @IncludeLinkedAdhocPeriods parameter to spf_GetCorrespondence proc",
        "versionObject":  {
                              "minor":  1,
                              "build":  763,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Multi Ad-hoc returns - Back Office - Browse - Taxpayer enquiry"
    },
    {
        "id":  268748,
        "version":  "3.1.767.0",
        "functionalNotes":  "Allow displaying period number in inbox for multiple adhoc taxtypes - when doing correspondence from back office and from online message",
        "developerNotes":  "Allow displaying period number in inbox for multiple adhoc taxtypes",
        "versionObject":  {
                              "minor":  1,
                              "build":  767,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Multi Ad-hoc returns - Online - Inbox"
    },
    {
        "id":  268749,
        "version":  "3.1.766.0",
        "functionalNotes":  "On the  (#2) statement, clicking Previous Period should display the  (#1) statement, and the Next Period button is now disabled. \nOn the (#1) statement, the Previous Period should be disabled, and clicking Next Period takes the user to (#2).",
        "developerNotes":  "Fix tax return statement previous and next tax return header calculation logic",
        "versionObject":  {
                              "minor":  1,
                              "build":  766,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Multi Ad-hoc returns - Online - Statement"
    },
    {
        "id":  268758,
        "version":  "3.1.756.0",
        "functionalNotes":  "Create webuser through website\nRequest access to a Taxpayer via website\nGet the codes and confirm access\nOpen the Taxpayer in BackOffice and go to Browse\u003eUserAccess\nTaxTypes listed should no longer be duplicated \n\n(only applies where TaxTypes assigned \u003c\u003e ALL)",
        "developerNotes":  "Update spf_WebUser_selectByTaxpayer to return distinctive tax types codes",
        "versionObject":  {
                              "minor":  1,
                              "build":  756,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Browse \u003e User Access showing duplicates of TaxTypes"
    },
    {
        "id":  268919,
        "version":  "3.1.760.0",
        "functionalNotes":  "Issue fixed that all labels should be showing correctly with the language user logged in",
        "developerNotes":  "Minor fix in AddressController - ConfigureAddressControls(). It is advisable to apply this changes if this file this method is overridden at client layer.",
        "versionObject":  {
                              "minor":  1,
                              "build":  760,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "AddressConfiguration non-defaults labels are not translated in common control AddressView"
    },
    {
        "id":  269066,
        "version":  "3.1.761.0",
        "functionalNotes":  "Issue fixes that previously the interests are gone after refund disbursed",
        "developerNotes":  "Fix spf_CalculateRefundInterest to remove undo CI logics prior interest calculation loop and to calculate the correct @CoreWorkAmount after refund payout. These changes are not required for Cyprus. Changes to be applied to all client who adopted refund interest feature.",
        "versionObject":  {
                              "minor":  1,
                              "build":  761,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Refund Credit Interest is reversed after refund is disbursed"
    },
    {
        "id":  269107,
        "version":  "3.1.764.0",
        "functionalNotes":  "No functional changes in iho, ensure split debt is still working as before",
        "developerNotes":  "Added new client proc spf_ProcessSplitTargetTaxReturnObject_Client to allow the flexibility to modify target tax return objects before split debt creation/update. By default, the value would be the same as source tax return.",
        "versionObject":  {
                              "minor":  1,
                              "build":  764,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Implement a new client hook to allow updates on split debt child return values"
    },
    {
        "id":  269145,
        "version":  "3.1.764.0",
        "functionalNotes":  "UI fixes to remove border on Registration tab when more tax types added in SystemConstant",
        "developerNotes":  "minor UI fix",
        "versionObject":  {
                              "minor":  1,
                              "build":  764,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Request to make minor  changes to Management dashboard"
    },
    {
        "id":  269155,
        "version":  "3.1.768.0",
        "functionalNotes":  "When logged in as an admin user, and assigning a case to yourself that was previously assigned to someone else before save/closing, upon reopening the case you should be able to progress it as normal. (Especially REG case)",
        "developerNotes":  "Added security repository to case repository to clear the cache on case save. Added user manipulation methods to the CoreTestHelper. Expanded security repo cache clearing.",
        "versionObject":  {
                              "minor":  1,
                              "build":  768,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Tester with Administrator role cannot progress Online REG case for Non-Individual as expected"
    },
    {
        "id":  269262,
        "version":  "3.1.775.0",
        "functionalNotes":  null,
        "developerNotes":  "Added specific IObjectionReason and ICaseTypeObjectionReason configuration to sandbox using new interfaces to fix sort order.",
        "versionObject":  {
                              "minor":  1,
                              "build":  775,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Sandbox Back Office Objections - Objection Reason dropdown order - other should be at the end of the list"
    },
    {
        "id":  269264,
        "version":  "3.1.773.0",
        "functionalNotes":  "Issue fixes that previously there is error in the Notification Service Email Failure Report and Email Sent Report",
        "developerNotes":  "I have added the missing resources into the processing service",
        "versionObject":  {
                              "minor":  1,
                              "build":  773,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Sandbox Back Office - Reports - Notification Service Email Failure Report and Email Sent Report - Missing Resource"
    },
    {
        "id":  269282,
        "version":  "3.1.752.0",
        "functionalNotes":  null,
        "developerNotes":  null,
        "versionObject":  {
                              "minor":  1,
                              "build":  752,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Sandbox Review - Users - the Save button does not work"
    },
    {
        "id":  269291,
        "version":  "3.1.764.0",
        "functionalNotes":  "Issue fixes that the associated tax types were not showing in web",
        "developerNotes":  "Fix assigning dependent tax types.",
        "versionObject":  {
                              "minor":  1,
                              "build":  764,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Web user permissions - When selecting Income Tax from the Tax Types Assigned it is not bringing through Provincial Instalment Tax with it"
    },
    {
        "id":  269316,
        "version":  "3.1.768.0",
        "functionalNotes":  "Attachments from Web shows with the correct file size in RMS BO and whole REF case workflow works as expected even the refund notice letter is displayed properly.",
        "developerNotes":  "Updated the CaseAttachment so it does not clear the FileSize when creating the case. This allows the details will display correctly.",
        "versionObject":  {
                              "minor":  1,
                              "build":  768,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Online REF request uploaded documents size shows 0 in RMS"
    },
    {
        "id":  269379,
        "version":  "3.1.772.0",
        "functionalNotes":  "Reports should now be working in the Review environment (Emails, Letters, Reports)",
        "developerNotes":  "Incorrectly set system constant. System constant set correctly on the relevant database (review) No PR needed, no code changes applied.\n\nIf this reoccurs, then investigation to what\u0027s corrupting the system constant value can be undertaken.",
        "versionObject":  {
                              "minor":  1,
                              "build":  772,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Case issues in Review Environment: Error Message when sending email or printing letter"
    },
    {
        "id":  269393,
        "version":  "3.1.769.0",
        "functionalNotes":  "When a Refund is in a RFD case that has already been disbursed, this change means a error will not be thrown, rather an empty file will be generated.",
        "developerNotes":  "Added handling for empty selected refund list, which can case an extract to be generated with no refunds in it, which is better than it throwing an exception.",
        "versionObject":  {
                              "minor":  1,
                              "build":  769,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "RFD Case: Generate Refund File Extract is not generating after 5 mins"
    },
    {
        "id":  269412,
        "version":  "3.1.773.0",
        "functionalNotes":  "This is not testable and can be closed after testing Bug 269262 . Note: This isn\u0027t \u0027testable\u0027 in the standard manner, it\u0027ll be used to enable the linked sandbox item.",
        "developerNotes":  "Added IObjectionReason configuration interface. This will need to be implemented by all regional teams who do not use Iho Standard / have translations, note, a template JSON has been generated and  included in the changeset of this PR.",
        "versionObject":  {
                              "minor":  1,
                              "build":  773,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "RMS Configuration: ICaseTypeObjectionReason does not support SortOrder"
    },
    {
        "id":  269556,
        "version":  "3.1.771.0",
        "functionalNotes":  "tester has verified that the integration test is picking up the correct previous return when there are multiple with the same Due Date",
        "developerNotes":  "NOTE: This will overwrite the cyprus client implementation of this proc and upgrade them to better logic.\n\nUpdated the period ordering to use the sort order column in alignment with get next  / pervious period.",
        "versionObject":  {
                              "minor":  1,
                              "build":  771,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "CYPRO-1132 - Returns - Prepopulating returns from the previous return may not use the correct previous return when there are multiple with the same Due Date"
    },
    {
        "id":  269662,
        "version":  "3.1.770.0",
        "functionalNotes":  null,
        "developerNotes":  null,
        "versionObject":  {
                              "minor":  1,
                              "build":  770,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Database changes"
    },
    {
        "id":  269663,
        "version":  "3.1.770.0",
        "functionalNotes":  null,
        "developerNotes":  null,
        "versionObject":  {
                              "minor":  1,
                              "build":  770,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Business Object changes and adding/updating tests for the same"
    },
    {
        "id":  269664,
        "version":  "3.1.770.0",
        "functionalNotes":  null,
        "developerNotes":  null,
        "versionObject":  {
                              "minor":  1,
                              "build":  770,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "UI changes"
    },
    {
        "id":  269665,
        "version":  "3.1.770.0",
        "functionalNotes":  null,
        "developerNotes":  null,
        "versionObject":  {
                              "minor":  1,
                              "build":  770,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Configuration changes"
    },
    {
        "id":  269671,
        "version":  "3.1.767.0",
        "functionalNotes":  "Internal to Ihov3_SysTest, setting up in the AMPART tax return design in Income (section 1 of 4), new questions and their corresponding fields:\n\nDisposable Date\nSupervised Area\nHide YesNo and date detail",
        "developerNotes":  "This is only for Iho as it is a config change\nSet up more questions for AMPART based on Cyprus Enhancement requirements\n\nAdd new tax return questions and detail questions in AMPART.sql, including disposal dates and visibility conditions.\nAdd Tax Return Question Online and BO to parent the 2 detail questions of type (Date, YesNo) that we need to test Cyprus enhancement.\nAdd a YesNo main question to change the YesNo detail question visibility based on its answer.\nAdd a main Date question to use in validation of the detail Date question as per Cyprus requirements.",
        "versionObject":  {
                              "minor":  1,
                              "build":  767,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Update AMPART config to include a Yes/No question, new detail questions and a new Date question"
    },
    {
        "id":  269689,
        "version":  "3.1.776.0",
        "functionalNotes":  "When multiple Ad Hoc returns have been filed on the same day they are assigned numbers sequentially starting at #1. When a filed return is deleted in the back office, the next filed return for that same Ad Hoc tax type will increase by 1, and will not re-purpose the deleted number.",
        "developerNotes":  "Enhance tax return period calculations and handling\n\nCalculate the TaxPeriod only when needed (the period date is determined by a question in the tax return)\nUpdated CalculateTaxReturnPeriodAsync to include a yearID parameter and return a nullable integer, improving period calculation logic.\nModified FindPeriodByTaxpayerAndAdhocDate in TaxPeriodRepository.cs to accept yearID, enhancing filtering capabilities.\nAdjusted SQL stored procedure spf_FindPeriodByTaxpayerAndAdhocDate to incorporate the new @YearID parameter for year-based filtering.\nCheck @IsMultiAdhoc in spf_TaxReturnDeleteReturn.sql to control dummy tax return creation based on multi-adhoc status.\nUpdated test cases in TaxPeriodRepositoryTest.cs to align with the new changes.\nReflected changes in the ITaxPeriodRepository interface for consistency.\nImproved clarity and maintainability with additional comments.",
        "versionObject":  {
                              "minor":  1,
                              "build":  776,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Multi Ad-hoc returns - Online - Deleted return is replaced with the same number"
    },
    {
        "id":  269706,
        "version":  "3.1.763.0",
        "functionalNotes":  "When a test has the DTLocalOnly tag, it should no longer run as part of Pull Requests, or anything other than a local run",
        "developerNotes":  "Updated DTLocalOnly attribute to ignore all build servers when running tests rather than only servers that have the word \u0027build\u0027 in them.",
        "versionObject":  {
                              "minor":  1,
                              "build":  763,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Update DTLocalOnly to stop running on all build servers not only ones that co..."
    },
    {
        "id":  269718,
        "version":  "3.1.774.0",
        "functionalNotes":  "Issue fixes to ensure multiple ad hoc tax type data is populated up in management dashboard",
        "developerNotes":  "Added iho only and configuration script to set up revenue accounting links for accounts used in adhoc tax types. All tax types linked to any frequency marked as Adhoc had a RevenueAccountHeading, subheading and cost center configured. Then all accounts linked for INC tax type were used to generate revenue account links for the adhoc taxtypes. RevenueAccountDescriptionLookup was then populated.",
        "versionObject":  {
                              "minor":  1,
                              "build":  774,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Management Dashboard - Ad Hoc - Mutiple ad hoc returns are not populated in some of the widgets "
    },
    {
        "id":  269723,
        "version":  "3.1.772.0",
        "functionalNotes":  "Issue fixes ensure multiple ad hoc tax types data shows correctly in Management Dashboard",
        "developerNotes":  "Small fixes in a MD proc",
        "versionObject":  {
                              "minor":  1,
                              "build":  772,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Management Dashboard - Ad Hoc - Filing \u0026 Collection figure is incorrect for multiple ad hoc returns"
    },
    {
        "id":  269724,
        "version":  "3.1.772.0",
        "functionalNotes":  "Issue fixes ensure multiple ad hoc tax types data shows correctly in Management Dashboard",
        "developerNotes":  "Small fixes in 2 MD procs",
        "versionObject":  {
                              "minor":  1,
                              "build":  772,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Management Dashboard - Ad Hoc - Compliance tab should not show any data for ad hoc tax types"
    },
    {
        "id":  269725,
        "version":  "3.1.764.0",
        "functionalNotes":  "When reCAPTCHA is enabled, there is purposeful second and half delay to avoid error message appearing because the web user has clicked login too quickly after (only possible with a saved password). The logged button is temporarily greyed out (disabled) to achieve this logging in too quickly.",
        "developerNotes":  "reCAPTCHA minor enhancements and tests\n\nUpdate login.js to fix the logic for disabling the login button for 1.5 seconds when reCAPTCHA is on to prevent users clicking log before reCAPTCHA finishes loading.\nUse InvariantCulture when parsing string to decimal.\nAdd reCAPTCHA unit tests.\n\n\nImpact high as:\nCyprus need to check that the new changes (specially the number formatting) are not causing them any grief.",
        "versionObject":  {
                              "minor":  1,
                              "build":  764,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Update Ihov3 code to use CultureInfo.InvariantCulture instead of CultureInfo.CurrentCulture"
    },
    {
        "id":  270186,
        "version":  "3.1.769.0",
        "functionalNotes":  "Page loads in no time and actions in back recon can be done without issue",
        "developerNotes":  "Remove loop cursor from proc spf_GetBankReconciliationTransactions to improve performance issue - no impact to client. \nMinor fix in proc spf_GetBankStatementMatchedDetailsList - no impact to client.\nRemove CaseNumber property from business object BankAccountTransaction - no impact to client. \nAdd code handling to get CaseNumber only for the selected transaction each time when it\u0027s needed in MatchTransactionsController - no impact to client.",
        "versionObject":  {
                              "minor":  1,
                              "build":  769,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Bank Recon Transaction Page doesn\u0027t load when there are too many transactions because the stored proc is too slow"
    },
    {
        "id":  270191,
        "version":  "3.1.768.0",
        "functionalNotes":  "There is only single space between the words in the Phone Numbers",
        "developerNotes":  "Removed extra space in the resource \"Text_Phone\", changed to match in IhoSharedWebModels",
        "versionObject":  {
                              "minor":  1,
                              "build":  768,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Browse - Contact details screen has a double space between the phone type and the word \u0027phone\u0027"
    },
    {
        "id":  270348,
        "version":  "3.1.767.0",
        "functionalNotes":  "When credit transfer configuration is setup for the same tax type with multiple frequencies the incorrect config could be picked up as the correct return frequency wasn\u0027t always being checked",
        "developerNotes":  "When credit transfer configuration is setup for the same tax type with multiple frequencies the incorrect config could be picked up as the correct return frequency wasn\u0027t always being checked\nChange to spf_AutomatedTransferCredit to ensure its checking the rhght config",
        "versionObject":  {
                              "minor":  1,
                              "build":  767,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Push - auto Credit transfer broken in 3.1.762.0"
    },
    {
        "id":  270437,
        "version":  "3.1.769.0",
        "functionalNotes":  "This resolves where there was validation triggering when a SUSR case can now be manually created for a taxpayer given their is un-assigned cash paid into the suspense account.",
        "developerNotes":  "Rolled back changes that made made limited the ability to add taxpayers without a suspense transaction i.e. Now allows the selection of taxpayers that do not have a suspension transaction",
        "versionObject":  {
                              "minor":  1,
                              "build":  769,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "SUSR - Unable to create case for non-suspense account Taxpayer"
    },
    {
        "id":  270474,
        "version":  "3.1.769.0",
        "functionalNotes":  "When spt_DeleteCasesByCaseType is run against a case with documentation, it should no longer throw an error with a dependency around CaseDocumentation table",
        "developerNotes":  "When spt_DeleteCasesByCaseType is run against a case with documentation, it should no longer throw an error with a dependency around CaseDocumentation table\nChanged the spt to have an extra delete before removing TaxpayerDocumentation",
        "versionObject":  {
                              "minor":  1,
                              "build":  769,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Case Type Deletion Issue - Documentation"
    },
    {
        "id":  270578,
        "version":  "3.1.769.0",
        "functionalNotes":  "As this was a performance improvement, there are no UI changes.",
        "developerNotes":  "Removed the filter on index on case_translation table to improve performance on case updates under load",
        "versionObject":  {
                              "minor":  1,
                              "build":  769,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Case Index - Performance Issue"
    },
    {
        "id":  270705,
        "version":  "3.1.770.0",
        "functionalNotes":  null,
        "developerNotes":  null,
        "versionObject":  {
                              "minor":  1,
                              "build":  770,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "[Testing] Return Detail Question Validation/Visibility driven by Main Question - BO"
    },
    {
        "id":  270744,
        "version":  "3.1.776.0",
        "functionalNotes":  "Issue fixes that when time spent was mandatory, update Assigned manager cause error.",
        "developerNotes":  "Remove time spent on task requirement when saving the case from the case tab, then re-instate it",
        "versionObject":  {
                              "minor":  1,
                              "build":  776,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "OBJ Case - Error with mandatory timespent field when changing Case Manager"
    },
    {
        "id":  270771,
        "version":  "3.1.771.0",
        "functionalNotes":  "Changes to the delete spt used to delete cases in a system to handle when appeal period discrepancy data has been setup. This will only exist for appeal and objection cases.\nThis spt is typically only called during initial client setup so this issue never normally occurs as the data won\u0027t exist at that point.",
        "developerNotes":  "The delete cases spt was failing as it wasn\u0027t removing from AppealPeriodDiscrepancy table before removing AppealPeriods",
        "versionObject":  {
                              "minor":  1,
                              "build":  771,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Case Type Deletion Issue - OBJ and APL cases "
    },
    {
        "id":  270792,
        "version":  "3.1.775.0",
        "functionalNotes":  null,
        "developerNotes":  null,
        "versionObject":  {
                              "minor":  1,
                              "build":  775,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Upgrade Sandbox to latest main"
    },
    {
        "id":  270892,
        "version":  "3.1.778.0",
        "functionalNotes":  "TestComplete Failed Runs Investigation and re-runs S26",
        "developerNotes":  "TestComplete Failed Runs Investigation and re-runs S26",
        "versionObject":  {
                              "minor":  1,
                              "build":  778,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "TestComplete Failed Runs Investigation and re-runs S30"
    },
    {
        "id":  270971,
        "version":  "3.1.774.0",
        "functionalNotes":  "Returns that were modified but had no real changes like no taxpayable changes were getting reversals posted un-necessarily if there was a config setting in tax type due days of \u0027o\u0027 - client override even if the setting wasn\u0027t against the tax type that was being changed.",
        "developerNotes":  "Returns that were modified but had no real changes like no taxpayable changes were getting reversals posted un-necessarily if there was a config setting in tax type due days of \u0027o\u0027 - client override even if the setting wasn\u0027t against the tax type that was being changed.\n\nThe procedure spf_CheckReverseTaxReturnNecessity has had its logic changed to properly check the tax return parameter only and not look across all returns for all taxpayers",
        "versionObject":  {
                              "minor":  1,
                              "build":  774,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Performance Issue - Reverse Tax Returns"
    },
    {
        "id":  271477,
        "version":  "3.1.778.0",
        "functionalNotes":  "This PR simplifies local debugging of IhoWeb and IhoApi, which previously required enabling IIS and its related modules. By switching to Kestrel with a default ASPNET Core dev certificate, developers can now debug both applications without dealing with tedious IIS setup.",
        "developerNotes":  "Description\nThis PR simplifies local debugging of IhoWeb and IhoApi, which previously required enabling IIS and its related modules. By switching to Kestrel with a default ASPNET Core dev certificate, developers can now debug both applications without dealing with tedious IIS setup.\n\nHow to use:\nUpdate IhoWeb and IhoApi to use their .exe startup targets.\n\nConfigure Multiple Startup Projects in the solution and set both IhoWeb and IhoApi to start together.\n\nTo set a startup project:\n\nRight-click on IhoWeb or IhoApi in Solution Explorer ? Set as Startup Project.\n\nOr, use the dropdown next to the Start Debugging button and select the desired project .exe.\n\nWith this setup, any developer can get started quicklyno IIS configuration required. Happy debugging! ??\n\nNote: In production, Kestrel is typically not exposed directly to HTTPS traffic. Instead, it runs behind a reverse proxy (such as Nginx, Apache, or IIS) that handles SSL/TLS termination. This setup is intended solely for local development.\n\nimage.png",
        "versionObject":  {
                              "minor":  1,
                              "build":  778,
                              "revision":  0,
                              "major":  3
                          },
        "title":  "Configure kestrel for local web debugging"
    }
]
